jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.h

/****************************************************************************************************//**
 * @file     nrf9120_mlm1.h
 *
 * @brief    CMSIS Cortex-M4 Peripheral Access Layer Header File for
 *           nrf9120_MLM1 from Nordic Semiconductor.
 *
 * @version  V1
 * @date     8. March 2018
 *
 * @note     Generated with SVDConv V2.81d
 *           from CMSIS SVD File 'nrf9120_MLM1.svd' Version 1,
 *
 * @par      Copyright (c) 2016, Nordic Semiconductor ASA
 *           All rights reserved.
 *
 *           Redistribution and use in source and binary forms, with or without
 *           modification, are permitted provided that the following conditions are met:
 *
 *           * Redistributions of source code must retain the above copyright notice, this
 *           list of conditions and the following disclaimer.
 *
 *           * Redistributions in binary form must reproduce the above copyright notice,
 *           this list of conditions and the following disclaimer in the documentation
 *           and/or other materials provided with the distribution.
 *
 *           * Neither the name of Nordic Semiconductor ASA nor the names of its
 *           contributors may be used to endorse or promote products derived from
 *           this software without specific prior written permission.
 *
 *           THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *           AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 *           IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 *           DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 *           FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 *           DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 *           SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 *           CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 *           OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 *           OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 *
 *******************************************************************************************************/



/** @addtogroup Nordic Semiconductor
  * @{
  */

/** @addtogroup nrf9120_MLM1
  * @{
  */

#ifndef NRF9120_MLM1_H
#define NRF9120_MLM1_H

#ifdef __cplusplus
extern "C" {
#endif


/* -------------------------  Interrupt Number Definition  ------------------------ */

typedef enum {
/* -------------------  Cortex-M4 Processor Exceptions Numbers  ------------------- */
  Reset_IRQn                    = -15,              /*!<   1  Reset Vector, invoked on Power up and warm reset                 */
  NonMaskableInt_IRQn           = -14,              /*!<   2  Non maskable Interrupt, cannot be stopped or preempted           */
  HardFault_IRQn                = -13,              /*!<   3  Hard Fault, all classes of Fault                                 */
  MemoryManagement_IRQn         = -12,              /*!<   4  Memory Management, MPU mismatch, including Access Violation
                                                         and No Match                                                          */
  BusFault_IRQn                 = -11,              /*!<   5  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory
                                                         related Fault                                                         */
  UsageFault_IRQn               = -10,              /*!<   6  Usage Fault, i.e. Undef Instruction, Illegal State Transition    */
  SVCall_IRQn                   =  -5,              /*!<  11  System Service Call via SVC instruction                          */
  DebugMonitor_IRQn             =  -4,              /*!<  12  Debug Monitor                                                    */
  PendSV_IRQn                   =  -2,              /*!<  14  Pendable request for system service                              */
  SysTick_IRQn                  =  -1,              /*!<  15  System Tick Timer                                                */
/* -------------------  nrf9120_MLM1 Specific Interrupt Numbers  ------------------ */
  MWU_IRQn                      =   1,              /*!<   1  MWU                                                              */
  CLOCK_POWER_IRQn              =   5,              /*!<   5  CLOCK_POWER                                                      */
  UARTE0_SPIM0_SPIS0_TWIM0_TWIS0_IRQn=   8,         /*!<   8  UARTE0_SPIM0_SPIS0_TWIM0_TWIS0                                   */
  UARTE1_SPIM1_SPIS1_TWIM1_TWIS1_IRQn=   9,         /*!<   9  UARTE1_SPIM1_SPIS1_TWIM1_TWIS1                                   */
  GPIOTE_IRQn                   =  10,              /*!<  10  GPIOTE                                                           */
  SAADC_IRQn                    =  11,              /*!<  11  SAADC                                                            */
  TIMER0_IRQn                   =  12,              /*!<  12  TIMER0                                                           */
  TIMER1_IRQn                   =  13,              /*!<  13  TIMER1                                                           */
  TIMER2_IRQn                   =  14,              /*!<  14  TIMER2                                                           */
  RTC0_IRQn                     =  15,              /*!<  15  RTC0                                                             */
  NFCT_IRQn                     =  17,              /*!<  17  NFCT                                                             */
  WDT_IRQn                      =  18,              /*!<  18  WDT                                                              */
  QDEC_IRQn                     =  19,              /*!<  19  QDEC                                                             */
  COMP_LPCOMP_IRQn              =  20,              /*!<  20  COMP_LPCOMP                                                      */
  SWI0_EGU0_IRQn                =  21,              /*!<  21  SWI0_EGU0                                                        */
  PWM0_IRQn                     =  22,              /*!<  22  PWM0                                                             */
  PDM_IRQn                      =  23,              /*!<  23  PDM                                                              */
  I2S_IRQn                      =  24,              /*!<  24  I2S                                                              */
  IPC_IRQn                      =  25,              /*!<  25  IPC                                                              */
  EXTFLASH_IRQn                 =  26,              /*!<  26  EXTFLASH                                                         */
  RTC1_IRQn                     =  27,              /*!<  27  RTC1                                                             */
  USBD_IRQn                     =  31               /*!<  31  USBD                                                             */
} IRQn_Type;


/** @addtogroup Configuration_of_CMSIS
  * @{
  */


/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/* ----------------Configuration of the Cortex-M4 Processor and Core Peripherals---------------- */
#define __CM4_REV                 0x0001            /*!< Cortex-M4 Core Revision                                               */
#define __MPU_PRESENT                  1            /*!< MPU present or not                                                    */
#define __NVIC_PRIO_BITS               3            /*!< Number of Bits used for Priority Levels                               */
#define __Vendor_SysTickConfig         0            /*!< Set to 1 if different SysTick Config is used                          */
#define __FPU_PRESENT                  1            /*!< FPU present or not                                                    */
/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm4.h"                               /*!< Cortex-M4 processor and core peripherals                              */
#include "system_nrf9120_mlm1.h"                    /*!< nrf9120_MLM1 System                                                   */


/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */


/** @addtogroup Device_Peripheral_Registers
  * @{
  */


/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler type
#endif


