jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.h
typedef struct {
  __IO uint32_t  TRACECLK;                          /*!< Pin number configuration for TRACECLK                                 */
  __IO uint32_t  TRACEDATA0;                        /*!< Pin number configuration for TRACEDATA[0] and SWO                     */
  __IO uint32_t  TRACEDATA1;                        /*!< Pin number configuration for TRACEDATA[1]                             */
  __IO uint32_t  TRACEDATA2;                        /*!< Pin number configuration for TRACEDATA[2]                             */
  __IO uint32_t  TRACEDATA3;                        /*!< Pin number configuration for TRACEDATA[3]                             */
} TAD_PSEL_Type;

typedef struct {
  __I  uint32_t  CONFIGID;                          /*!< Configuration identifier                                              */
  __I  uint32_t  DEVICEID[2];                       /*!< Description collection[0]: Device identifier                          */
  __I  uint32_t  PART;                              /*!< Part code                                                             */
  __I  uint32_t  VARIANT;                           /*!< Part Variant, Hardware version and Production configuration           */
  __I  uint32_t  PACKAGE;                           /*!< Package option                                                        */
  __I  uint32_t  RAM;                               /*!< RAM variant                                                           */
  __I  uint32_t  FLASH;                             /*!< Flash variant                                                         */
  __I  uint32_t  CODEPAGESIZE;                      /*!< Code memory page size                                                 */
  __I  uint32_t  CODESIZE;                          /*!< Code memory size                                                      */
  __I  uint32_t  DEVICETYPE;                        /*!< Device type                                                           */
} FICR_INFO_Type;

typedef struct {
  __I  uint32_t  ADDR;                              /*!< Description cluster[0]: Address                                       */
  __I  uint32_t  DATA;                              /*!< Description cluster[0]: Data                                          */
} FICR_TRIMCNF_Type;

typedef struct {
  __IO uint32_t  CPU;                               /*!< AHB bus master priority register for CPU                              */
  __IO uint32_t  EXTRAM[2];                         /*!< Description collection[0]: AHB bus master priority register
                                                         for external RAM slave port (EXTRAMs)                                 */
} AMLI_RAMPRI_Type;

typedef struct {
  __IO uint32_t  PROTECT[3];                        /*!< Description collection[0]: Control access for Master connected
                                                         to AMLI master port EXTPERI[0]                                        */
} DCNF_EXTPERI0_Type;

typedef struct {
  __IO uint32_t  UNUSED0;                           /*!< Unspecified                                                           */
} DCNF_EXTPERI1_Type;

typedef struct {
  __IO uint32_t  PROTECT[3];                        /*!< Description collection[0]: Control access from Master connected
                                                         to AMLI master port EXTRAM[0]                                         */
} DCNF_EXTRAM_Type;

typedef struct {
  __IO uint32_t  UNUSED0;                           /*!< Unspecified                                                           */
} DCNF_EXTPERI2_Type;

typedef struct {
  __IO uint32_t  PROTECT;                           /*!< Description cluster[0]: Control access from Master connected
                                                         to AMLI master port EXTCODE[0]                                        */
} DCNF_EXTCODE_Type;

typedef struct {
  __IO uint32_t  UNUSED0;                           /*!< Unspecified                                                           */
} DCNF_EXTPERI3_Type;

typedef struct {
  __IO uint32_t  WA;                                /*!< Description cluster[0]: Write access to region 0 detected             */
  __IO uint32_t  RA;                                /*!< Description cluster[0]: Read access to region 0 detected              */
} MWU_EVENTS_REGION_Type;

typedef struct {
  __IO uint32_t  WA;                                /*!< Description cluster[0]: Write access to peripheral region 0
                                                         detected                                                              */
  __IO uint32_t  RA;                                /*!< Description cluster[0]: Read access to peripheral region 0 detected   */
} MWU_EVENTS_PREGION_Type;

typedef struct {
  __IO uint32_t  WA;                                /*!< Description cluster[0]: Publish configuration for EVENTS_REGION[0].WA */
  __IO uint32_t  RA;                                /*!< Description cluster[0]: Publish configuration for EVENTS_REGION[0].RA */
} MWU_PUBLISH_REGION_Type;

typedef struct {
  __IO uint32_t  WA;                                /*!< Description cluster[0]: Publish configuration for EVENTS_PREGION[0].WA */
  __IO uint32_t  RA;                                /*!< Description cluster[0]: Publish configuration for EVENTS_PREGION[0].RA */
} MWU_PUBLISH_PREGION_Type;

typedef struct {
  __IO uint32_t  SUBSTATWA;                         /*!< Description cluster[0]: Source of event/interrupt in region
                                                         0, write access detected while corresponding subregion was enabled
                                                          for watching                                                         */
  __IO uint32_t  SUBSTATRA;                         /*!< Description cluster[0]: Source of event/interrupt in region
                                                         0, read access detected while corresponding subregion was enabled
                                                          for watching                                                         */
} MWU_PERREGION_Type;

