jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.h
typedef struct {
  __IO uint32_t  SRC;                               /*!< Flash memory source address.                                          */
  __IO uint32_t  DST;                               /*!< RAM destination address.                                              */
  __IO uint32_t  CNT;                               /*!< Read transfer length.                                                 */
} QSPI_READ_Type;

typedef struct {
  __IO uint32_t  DST;                               /*!< Flash destination address.                                            */
  __IO uint32_t  SRC;                               /*!< RAM source address.                                                   */
  __IO uint32_t  CNT;                               /*!< Write transfer length.                                                */
} QSPI_WRITE_Type;

typedef struct {
  __IO uint32_t  PTR;                               /*!< Start address of Flash block to be erased.                            */
  __IO uint32_t  LEN;                               /*!< Size of block to be erased.                                           */
} QSPI_ERASE_Type;

typedef struct {
  __IO uint32_t  SCK;                               /*!< Pin select for serial clock SCK. Connected to SPI interface
                                                         pins of SPI-MEM-CTRL.                                                 */
  __IO uint32_t  CSN;                               /*!< Pin select for chip select signal CSN. Connected to SPI interface
                                                         pins of SPI-MEM-CTRL.                                                 */
  __IO uint32_t  CSN1;                              /*!< Pin select for chip select signal CSN1. Not implemented!.             */
  __IO uint32_t  IO0;                               /*!< Pin select for serial data MOSI/IO0. Connected to SPI interface
                                                         pins of SPI-MEM-CTRL                                                  */
  __IO uint32_t  IO1;                               /*!< Pin select for serial data MISO/IO1. Connected to SPI interface
                                                         pins of SPI-MEM-CTRL.                                                 */
  __IO uint32_t  IO2;                               /*!< Pin select for serial data IO2. Connected to SPI interface pins
                                                         of SPI-MEM-CTRL.                                                      */
  __IO uint32_t  IO3;                               /*!< Pin select for serial data IO3. Connected to SPI interface pins
                                                         of SPI-MEM-CTRL.                                                      */
} QSPI_PSEL_Type;

typedef struct {
  __I  uint32_t  EPIN[8];                           /*!< Description collection[0]: IN endpoint halted status. Can be
                                                         used as is as response to a GetStatus() request to endpoint.          */
  __I  uint32_t  RESERVED3;
  __I  uint32_t  EPOUT[8];                          /*!< Description collection[0]: OUT endpoint halted status. Can be
                                                         used as is as response to a GetStatus() request to endpoint.          */
} USBD_HALTED_Type;

typedef struct {
  __IO uint32_t  EPOUT[8];                          /*!< Description collection[0]: Amount of bytes received last in
                                                         the data stage of this OUT endpoint                                   */
  __IO uint32_t  ISOOUT;                            /*!< Description collection[0]: Amount of bytes received last on
                                                         this iso OUT data endpoint                                            */
} USBD_SIZE_Type;

typedef struct {
  __IO uint32_t  PTR;                               /*!< Description cluster[0]: Data pointer                                  */
  __IO uint32_t  MAXCNT;                            /*!< Description cluster[0]: Maximum number of bytes to transfer           */
  __I  uint32_t  AMOUNT;                            /*!< Description cluster[0]: Number of bytes transferred in the last
                                                         transaction                                                           */
  __IO uint32_t  CONFIG;                            /*!< Description cluster[0]: Endpoint EasyDMA configuration                */
  __IO uint32_t  LIST;                              /*!< Description cluster[0]: EasyDMA list type                             */
} USBD_EPIN_Type;

typedef struct {
  __IO uint32_t  PTR;                               /*!< Description cluster[0]: Data pointer                                  */
  __IO uint32_t  MAXCNT;                            /*!< Description cluster[0]: Maximum number of bytes to transfer           */
  __I  uint32_t  AMOUNT;                            /*!< Description cluster[0]: Number of bytes transferred in the last
                                                         transaction                                                           */
  __IO uint32_t  CONFIG;                            /*!< Description cluster[0]: Isochronous endpoint EasyDMA configuration    */
} USBD_ISOIN_Type;

typedef struct {
  __IO uint32_t  PTR;                               /*!< Description cluster[0]: Data pointer                                  */
  __IO uint32_t  MAXCNT;                            /*!< Description cluster[0]: Maximum number of bytes to transfer           */
  __I  uint32_t  AMOUNT;                            /*!< Description cluster[0]: Number of bytes transferred in the last
                                                         transaction                                                           */
  __IO uint32_t  CONFIG;                            /*!< Description cluster[0]: Endpoint EasyDMA configuration                */
  __IO uint32_t  LIST;                              /*!< Description cluster[0]: EasyDMA list type                             */
} USBD_EPOUT_Type;

