jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.h
typedef struct {
  __IO uint32_t  PTR;                               /*!< Description cluster[0]: Data pointer                                  */
  __IO uint32_t  MAXCNT;                            /*!< Description cluster[0]: Maximum number of bytes to transfer           */
  __I  uint32_t  AMOUNT;                            /*!< Description cluster[0]: Number of bytes transferred in the last
                                                         transaction                                                           */
  __IO uint32_t  CONFIG;                            /*!< Description cluster[0]: Isochronous endpoint EasyDMA configuration    */
} USBD_ISOOUT_Type;

typedef struct {
  __I  uint32_t  TESTTC;                            /*!< Description cluster[0]: Observe the TC output from the flash
                                                         macro                                                                 */
  __IO uint32_t  UNUSED0;                           /*!< Unspecified                                                           */
  __IO uint32_t  TESTDATA128[4];                    /*!< Description collection[0]: Direct flash test data word 0              */
  __I  uint32_t  TESTDATA128INC[4];                 /*!< Description collection[0]: Direct flash test data word 0. Post-increments
                                                         TESTCONTROLADDR                                                       */
  __I  uint32_t  TESTCMPINC;                        /*!< Description cluster[0]: Reads and compares last flash row to
                                                         TESTDATA128 content. Post-increments TESTCONTROLADDR.                 */
  __I  uint32_t  TESTNCMPINC;                       /*!< Description cluster[0]: Reads and compares last flash row to
                                                         complement of TESTDATA128 content. Post-increments TESTCONTROLADDR.   */
  __IO uint32_t  TESTCONTROLLINES;                  /*!< Description cluster[0]: Direct flash test, control lines. Refer
                                                         to the flash IP test documentation for more details.                  */
  __IO uint32_t  TESTCONTROLADDR;                   /*!< Description cluster[0]: Direct flash test control, address lines      */
  __IO uint32_t  TESTCOUNTERRELOAD;                 /*!< Description cluster[0]: Counter reload value, used when counting
                                                         from SE or YE rising edge to latching of data                         */
  __I  uint32_t  TESTCOUNTERRUNNING;                /*!< Description cluster[0]: Returns the state (counting or not)
                                                         of the counter                                                        */
  __IO uint32_t  TESTCONFIG;                        /*!< Description cluster[0]: Mode of operation of the counter              */
  __IO uint32_t  TESTTMVPPANAEN;                    /*!< Description cluster[0]: Controls analog signals for flash measurements */
  __IO uint32_t  UNUSED1[14];                       /*!< Description collection[0]: Unspecified                                */
} NVMC_TEST_Type;

typedef struct {
  __IO uint32_t  POWER;                             /*!< Description cluster[0]: RAM0 power control register                   */
  __O  uint32_t  POWERSET;                          /*!< Description cluster[0]: RAM0 power control set register               */
  __O  uint32_t  POWERCLR;                          /*!< Description cluster[0]: RAM0 power control clear register             */
  __IO uint32_t  UNUSED0;                           /*!< Unspecified                                                           */
} VMC_RAM_Type;

typedef struct {
  __IO uint32_t  OUT;                               /*!< Description cluster[0]: Pin 0 direct access output register           */
  __IO uint32_t  IN;                                /*!< Description cluster[0]: Pin 0 direct access input register            */
} GPIO_PIN_Type;


/* ================================================================================ */
/* ================                       TAD                      ================ */
/* ================================================================================ */


/**
  * @brief Trace and debug control (TAD)
  */

typedef struct {                                    /*!< TAD Structure                                                         */
  __I  uint32_t  RESERVED0[320];
  __IO uint32_t  ENABLE;                            /*!< Enable debug domain and aquire selected GPIOs                         */
  TAD_PSEL_Type PSEL;                               /*!< Unspecified                                                           */
  __IO uint32_t  TRACEPORTSPEED;                    /*!< Clocking options for the Trace Port debug interface                   */
} NRF_TAD_Type;


/* ================================================================================ */
/* ================                      FICR                      ================ */
/* ================================================================================ */


/**
  * @brief Factory Information Configuration Registers (FICR)
  */

typedef struct {                                    /*!< FICR Structure                                                        */
  __I  uint32_t  CHIPCONF00;                        /*!< Miscellaneous analog configuration. Will be set during production
                                                         test.                                                                 */
  __I  uint32_t  CHIPCONF01;                        /*!< Miscellaneous analog configuration. Will be set during production
                                                         test.                                                                 */
  __I  uint32_t  CHIPCONF02;                        /*!< Miscellaneous analog configuration. Will be set during production
                                                         test.                                                                 */
  __I  uint32_t  CHIPCONF03;                        /*!< Miscellaneous analog configuration. Will be set during production
                                                         test.                                                                 */
  __I  uint32_t  CHIPCONF04;                        /*!< Miscellaneous analog configuration. Will be set during production
                                                         test.                                                                 */
  __I  uint32_t  CHIPCONF05;                        /*!< Miscellaneous analog configuration. Will be set during production
                                                         test.                                                                 */
  __I  uint32_t  CHIPCONF06;                        /*!< Miscellaneous analog configuration. Will be set during production
                                                         test.                                                                 */
  __I  uint32_t  RESERVED0[53];
  __I  uint32_t  FLASHPWRUP0;                       /*!< Power-up pattern for flash                                            */
  __I  uint32_t  FLASHPWRUP1;                       /*!< Power-up pattern for flash                                            */
  __I  uint32_t  FLASHPWRUP2;                       /*!< Power-up pattern for flash                                            */
  __I  uint32_t  FLASHPWRUP3;                       /*!< Power-up pattern for flash                                            */

  union {
    __I  uint32_t  TESTSTATUS;                      /*!< Code memory test status. Will be set during production test.          */
    __I  uint32_t  RAM;                             /*!< RAM variant                                                           */
  };

  union {
    __I  uint32_t  CPTEST0;                         /*!< Result from Circuit Probe test                                        */
    __I  uint32_t  FLASH;                           /*!< Flash variant                                                         */
  };
  __I  uint32_t  CPTEST00;                          /*!< Result from Circuit Probe test                                        */
  __I  uint32_t  CPTEST1;                           /*!< Result from Circuit Probe test                                        */
  __I  uint32_t  CPTEST2;                           /*!< Result from Circuit Probe test                                        */
  __I  uint32_t  CPTEST3;                           /*!< Result from Circuit Probe test                                        */
  __I  uint32_t  CPTEST4;                           /*!< Result from Circuit Probe test                                        */
  __I  uint32_t  CPTEST5;                           /*!< Result from Circuit Probe test, flash repair information              */
  __I  uint32_t  CPTEST6;                           /*!< Result from Circuit Probe test, flash repair information              */
  __I  uint32_t  CPTEST7;                           /*!< Result from Circuit Probe test, flash repair information              */
  __I  uint32_t  CPTEST8;                           /*!< Result from Circuit Probe test, flash repair information              */
  __I  uint32_t  RESERVED1[53];
  FICR_INFO_Type INFO;                              /*!< Device info                                                           */
  __I  uint32_t  RESERVED2[53];
  FICR_TRIMCNF_Type TRIMCNF[32];                    /*!< Unspecified                                                           */
} NRF_FICR_Type;


/* ================================================================================ */
/* ================                      UICR                      ================ */
/* ================================================================================ */


/**
  * @brief User Information Configuration Registers (UICR)
  */

typedef struct {                                    /*!< UICR Structure                                                        */
  __IO uint32_t  APPROTECT;                         /*!< Access port protection                                                */
  __IO uint32_t  PSELRESET[2];                      /*!< Description collection[0]: Mapping of the nRESET function (see
                                                         POWER chapter for details)                                            */
  __IO uint32_t  EXTSUPPLY;                         /*!< Enable external circuitry to be supplied from VDD pin. Applicable
                                                         in "High voltage mode" only.                                          */
  __IO uint32_t  REGOUT0;                           /*!< GPIO reference voltage / external output supply voltage in "High
                                                         voltage mode".                                                        */
  __IO uint32_t  NFCPINS;                           /*!< Setting of pins dedicated to NFC functionality: NFC antenna
                                                         or GPIO                                                               */
  __IO uint32_t  XOSC32M;                           /*!< Oscillator Control                                                    */
  __I  uint32_t  RESERVED0[57];
  __IO uint32_t  NRFHW[32];                         /*!< Description collection[0]: Reserved for Nordic hardware design        */
  __I  uint32_t  RESERVED1[32];
  __IO uint32_t  NRFFW[32];                         /*!< Description collection[0]: Reserved for Nordic firmware design        */
  __I  uint32_t  RESERVED2[32];
  __IO uint32_t  CUSTOMER[32];                      /*!< Description collection[0]: Reserved for customer                      */
} NRF_UICR_Type;


/* ================================================================================ */
/* ================                 PMU_REGULATORS                 ================ */
/* ================================================================================ */


/**
  * @brief PMU_REGULATORS (PMU_REGULATORS)
  */

