jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.h
typedef struct {                                    /*!< PMU_REGULATORS Structure                                              */
  __I  uint32_t  UNUSED;                            /*!< Unused.                                                               */
} NRF_PMU_REGULATORS_Type;


/* ================================================================================ */
/* ================                 PMU_OSCILLATORS                ================ */
/* ================================================================================ */


/**
  * @brief PMU_OSCILLATORS (PMU_OSCILLATORS)
  */

typedef struct {                                    /*!< PMU_OSCILLATORS Structure                                             */
  __I  uint32_t  UNUSED;                            /*!< Unused.                                                               */
} NRF_PMU_OSCILLATORS_Type;


/* ================================================================================ */
/* ================                    RADIOLTE                    ================ */
/* ================================================================================ */


/**
  * @brief LTE-M Radio (RADIOLTE)
  */

typedef struct {                                    /*!< RADIOLTE Structure                                                    */
  __I  uint32_t  UNUSED;                            /*!< Unused.                                                               */
} NRF_RADIOLTE_Type;


/* ================================================================================ */
/* ================                      AMLI                      ================ */
/* ================================================================================ */


/**
  * @brief AHB Multi-Layer Interface (AMLI)
  */

typedef struct {                                    /*!< AMLI Structure                                                        */
  __I  uint32_t  RESERVED0[896];
  AMLI_RAMPRI_Type RAMPRI;                          /*!< RAM configurable priority configuration structure                     */
} NRF_AMLI_Type;


/* ================================================================================ */
/* ================                      DCNF                      ================ */
/* ================================================================================ */


/**
  * @brief Domain Configuration Management (DCNF)
  */

typedef struct {                                    /*!< DCNF Structure                                                        */
  __I  uint32_t  RESERVED0[264];
  __I  uint32_t  CPUID;                             /*!< CPU number in the system                                              */
  __I  uint32_t  RESERVED1[7];
  DCNF_EXTPERI0_Type EXTPERI0;                      /*!< Unspecified                                                           */
  DCNF_EXTPERI1_Type EXTPERI1[5];                   /*!< Unspecified                                                           */
  DCNF_EXTRAM_Type EXTRAM;                          /*!< Unspecified                                                           */
  DCNF_EXTPERI2_Type EXTPERI2[5];                   /*!< Unspecified                                                           */
  DCNF_EXTCODE_Type EXTCODE[2];                     /*!< Unspecified                                                           */
  DCNF_EXTPERI3_Type EXTPERI3[6];                   /*!< Unspecified                                                           */
} NRF_DCNF_Type;


/* ================================================================================ */
/* ================                       MWU                      ================ */
/* ================================================================================ */


/**
  * @brief Memory Watch Unit (MWU)
  */

typedef struct {                                    /*!< MWU Structure                                                         */
  __I  uint32_t  RESERVED0[64];
  MWU_EVENTS_REGION_Type EVENTS_REGION[4];          /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED1[16];
  MWU_EVENTS_PREGION_Type EVENTS_PREGION[2];        /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED2[4];
  MWU_PUBLISH_REGION_Type PUBLISH_REGION[4];        /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED3[16];
  MWU_PUBLISH_PREGION_Type PUBLISH_PREGION[2];      /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED4[68];
  __IO uint32_t  INTEN;                             /*!< Enable or disable interrupt                                           */
  __IO uint32_t  INTENSET;                          /*!< Enable interrupt                                                      */
  __IO uint32_t  INTENCLR;                          /*!< Disable interrupt                                                     */
  __I  uint32_t  RESERVED5[5];
  __IO uint32_t  NMIEN;                             /*!< Enable or disable non-maskable interrupt                              */
  __IO uint32_t  NMIENSET;                          /*!< Enable non-maskable interrupt                                         */
  __IO uint32_t  NMIENCLR;                          /*!< Disable non-maskable interrupt                                        */
  __I  uint32_t  RESERVED6[53];
  MWU_PERREGION_Type PERREGION[2];                  /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED7[64];
  __IO uint32_t  REGIONEN;                          /*!< Enable/disable regions watch                                          */
  __IO uint32_t  REGIONENSET;                       /*!< Enable regions watch                                                  */
  __IO uint32_t  REGIONENCLR;                       /*!< Disable regions watch                                                 */
  __I  uint32_t  RESERVED8[57];
  MWU_REGION_Type REGION[4];                        /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED9[32];
  MWU_PREGION_Type PREGION[2];                      /*!< Unspecified                                                           */
} NRF_MWU_Type;


/* ================================================================================ */
/* ================                   REGULATORS                   ================ */
/* ================================================================================ */


/**
  * @brief Voltage Regulators control (REGULATORS)
  */

typedef struct {                                    /*!< REGULATORS Structure                                                  */
  __I  uint32_t  RESERVED0[269];
  __IO uint32_t  DISABLEHPBOR;                      /*!< Enable or disable HPBOR                                               */
  __I  uint32_t  RESERVED1[50];
  __O  uint32_t  SYSTEMOFF;                         /*!< System OFF register                                                   */
  __I  uint32_t  RESERVED2;
  __IO uint32_t  UNUSED0;                           /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED3;
  __IO uint32_t  POFCON;                            /*!< Power failure comparator configuration                                */
  __I  uint32_t  RESERVED4[13];
  __IO uint32_t  FORCEOFFNVM;                       /*!< Force off NVM supply. See also the internal section in the NVMC
                                                         chapter.                                                              */
  __I  uint32_t  RESERVED5[11];
  __IO uint32_t  DCDCEN;                            /*!< DC/DC enable register for REG1 (DVDD_0V9).                            */
  __IO uint32_t  DCDCEN2;                           /*!< DC/DC enable register for REG2 (AVDD_1V3)                             */
  __IO uint32_t  DCDCENMIR;                         /*!< Enable mirroring of DCDCEN register into DCDCEN2 register.            */
  __I  uint32_t  RESERVED6;
  __IO uint32_t  ATEPOWER;                          /*!< Analog test bus control for power modules                             */
  __I  uint32_t  RESERVED7[17];
  __IO uint32_t  DCDCCONFREG1;                      /*!< Configuration register for REG1 DCDC regulator (DVDD_0V9).            */
  __IO uint32_t  DCDCCONFREG2;                      /*!< Configuration register for REG2 DCDC regulator (AVDD_1V3).            */
  __I  uint32_t  RESERVED8[268];
  __IO uint32_t  UNUSED1;                           /*!< Unspecified                                                           */
  __IO uint32_t  UNUSED2;                           /*!< Unspecified                                                           */
  __IO uint32_t  FORCEMODEREG1;                     /*!< A backdoor register for manual selection of REG1 regulator mode
                                                         (DVDD_0V9)                                                            */
  __I  uint32_t  RESERVED9[3];
  __O  uint32_t  THRESHOLDREG1;                     /*!< Set threshold value of REG1 DCDC regulator                            */
  __O  uint32_t  ENFORCEMODEREG1;                   /*!< Enable forcing of power mode in REG1 voltage regulator                */
  __O  uint32_t  IGNOREDAPCMODE;                    /*!< Ignore DAPCP power mode                                               */
  __I  uint32_t  CURRENTMODEREG1;                   /*!< Currently used power mode of the REG1 voltage regulator               */
  __IO uint32_t  FORCEMODEREG2;                     /*!< A backdoor register for manual selection of REG2 regulator mode
                                                         (DVDD_1V3)                                                            */
  __I  uint32_t  RESERVED10;
  __O  uint32_t  THRESHOLDREG2;                     /*!< Set threshold value of REG2 DCDC regulator                            */
  __O  uint32_t  ENFORCEMODEREG2;                   /*!< Enable forcing of power mode in REG2 voltage regulator                */
  __IO uint32_t  DISABLEHSLIMITREG2;                /*!< Disable HSLIMIT for REG2 DCDC regulator                               */
  __I  uint32_t  CURRENTMODEREG2;                   /*!< Currently used power mode of the REG2 voltage regulator               */
  __IO uint32_t  DISABLEHSLIMITREG1;                /*!< Disable HSLIMIT for REG1 DCDC regulator                               */
  __I  uint32_t  RESERVED11[2];
  __IO uint32_t  LDOCONFREG1;                       /*!< Configuration register for REG1 LDO regulator (DVDD_0V9).             */
  __IO uint32_t  LDOTESTLOADREG1;                   /*!< Test load setting for REG1 LDO regulator (DVDD_0V9).                  */
  __IO uint32_t  LDOCONFREG2;                       /*!< Configuration register for REG2 LDO regulator (AVDD_1V3).             */
  __IO uint32_t  LDOTESTLOADREG2;                   /*!< Test load setting for REG2 LDO regulator (AVDD_1V3).                  */
  __IO uint32_t  ULPCONFREG1;                       /*!< Configuration register for REG1 ULP regulator (DVDD_0V9).             */
  __IO uint32_t  ULPCONFREG2;                       /*!< Configuration register for REG2 ULP regulator (AVDD_1V3).             */
  __IO uint32_t  VREG_HIGH_REG1;                    /*!< Increase voltage to AVDD_1V3 levels for REG1 LDO regulator (DVDD_0V9) */
  __IO uint32_t  ULP_HIGH_REG1;                     /*!< Increase voltage to AVDD_1V3 ULP levels for REG1 ULP regulator
                                                         (DVDD_0V9)                                                            */
  __I  uint32_t  RESERVED12[285];
  __IO uint32_t  DISABLESRAMSYSTEMOFFACK;           /*!< Enable or disable System OFF ack from SRAM                            */
  __IO uint32_t  DISABLENVMSYSTEMOFFACK;            /*!< Enable or disable System OFF ack from NVM                             */
} NRF_REGULATORS_Type;


/* ================================================================================ */
/* ================                   OSCILLATORS                  ================ */
/* ================================================================================ */


/**
  * @brief Oscillators control (OSCILLATORS)
  */

typedef struct {                                    /*!< OSCILLATORS Structure                                                 */
  __I  uint32_t  RESERVED0[353];
  __IO uint32_t  ATECLOCK;                          /*!< Analog test bus control for clock modules                             */
  __I  uint32_t  RESERVED1[15];
  __IO uint32_t  XOSC32MACCPL;                      /*!< HFXO bypass mode selection.                                           */
  __I  uint32_t  RESERVED2[14];
  __IO uint32_t  BYPASS32KI;                        /*!< Enable or disable bypass of LFCLK crystal oscillator with external
                                                         clock source                                                          */
  __IO uint32_t  POWERDOWN32KI;                     /*!< Enable/Disable forced power power down of LFXO                        */
  __IO uint32_t  HFQSTRT;                           /*!< TBD                                                                   */
  __IO uint32_t  UNUSED0;                           /*!< Unspecified                                                           */
  __IO uint32_t  HFCTRL;                            /*!< Temporary for CLOCK HFCTRL                                            */
  __IO uint32_t  BYPASS32M;                         /*!< Enable or disable bypass of HFCLK crystal oscillator with external
                                                         clock source                                                          */
  __IO uint32_t  XOSC32MCTRL;                       /*!< Reserved for future use                                               */
  __IO uint32_t  BBDLL;                             /*!< BBDLL override register in case BBDLL does not behave as expected     */
} NRF_OSCILLATORS_Type;


/* ================================================================================ */
/* ================                      CLOCK                     ================ */
/* ================================================================================ */


/**
  * @brief Clock Management (CLOCK)
  */

typedef struct {                                    /*!< CLOCK Structure                                                       */
  __O  uint32_t  TASKS_HFCLKSTART;                  /*!< Start HFCLK crystal oscillator                                        */
  __O  uint32_t  TASKS_HFCLKSTOP;                   /*!< Stop HFCLK crystal oscillator                                         */
  __O  uint32_t  TASKS_LFCLKSTART;                  /*!< Start LFCLK source                                                    */
  __O  uint32_t  TASKS_LFCLKSTOP;                   /*!< Stop LFCLK source                                                     */
  __I  uint32_t  RESERVED0[28];
  __IO uint32_t  SUBSCRIBE_HFCLKSTART;              /*!< Subscribe configuration for TASKS_HFCLKSTART                          */
  __IO uint32_t  SUBSCRIBE_HFCLKSTOP;               /*!< Subscribe configuration for TASKS_HFCLKSTOP                           */
  __IO uint32_t  SUBSCRIBE_LFCLKSTART;              /*!< Subscribe configuration for TASKS_LFCLKSTART                          */
  __IO uint32_t  SUBSCRIBE_LFCLKSTOP;               /*!< Subscribe configuration for TASKS_LFCLKSTOP                           */
  __I  uint32_t  RESERVED1[28];
  __IO uint32_t  EVENTS_HFCLKSTARTED;               /*!< HFCLK oscillator started                                              */
  __IO uint32_t  EVENTS_LFCLKSTARTED;               /*!< LFCLK started                                                         */
  __I  uint32_t  RESERVED2[30];
  __IO uint32_t  PUBLISH_HFCLKSTARTED;              /*!< Publish configuration for EVENTS_HFCLKSTARTED                         */
  __IO uint32_t  PUBLISH_LFCLKSTARTED;              /*!< Publish configuration for EVENTS_LFCLKSTARTED                         */
  __I  uint32_t  RESERVED3[94];
  __IO uint32_t  INTEN;                             /*!< Enable or disable interrupt                                           */
  __IO uint32_t  INTENSET;                          /*!< Enable interrupt                                                      */
  __IO uint32_t  INTENCLR;                          /*!< Disable interrupt                                                     */
  __I  uint32_t  INTPEND;                           /*!< Pending status of interrupt                                           */
  __I  uint32_t  RESERVED4[62];
  __I  uint32_t  HFCLKRUN;                          /*!< Status indicating that HFCLKSTART task has been triggered             */
  __I  uint32_t  HFCLKSTAT;                         /*!< Which HFCLK source is running                                         */
  __I  uint32_t  RESERVED5;
  __I  uint32_t  LFCLKRUN;                          /*!< Status indicating that LFCLKSTART task has been triggered             */
  __I  uint32_t  LFCLKSTAT;                         /*!< Which LFCLK source is running                                         */
  __I  uint32_t  LFCLKSRCCOPY;                      /*!< Copy of LFCLKSRC register, set when LFCLKSTART task was triggered
                                                         LFULP is not treat as a separate clock source on Alta MLM1,
                                                          where default clock source (0) is LFRC.                              */
  __I  uint32_t  RESERVED6[4];
  __IO uint32_t  HFCLKCURRFREQ;                     /*!< Current frequency of HFCLK                                            */
  __I  uint32_t  RESERVED7[56];
  __IO uint32_t  HFCLKSRC;                          /*!< Clock source for the HFCLK oscillator, and configuration of
                                                         XTAL oscillator. This register shall only be written while no
                                                          oscillation is present on XC1. Failing to do so may cause unexpected
                                                          behaviour.                                                           */
  __IO uint32_t  LFCLKSRC;                          /*!< Clock source for the LFCLK. LFCLKSTART task starts starts a
                                                         clock source selected with this register. LFULP is not treat
                                                          as a separate clock source on Alta MLM1, where default clock
                                                          source (0) is LFRC.                                                  */
  __I  uint32_t  RESERVED8[15];
  __IO uint32_t  HFCLKCTRL;                         /*!< HFCLK frequency configuration. The feature is not implemented
                                                         on Alta MLM1. Specification of this feature is under discussion.
                                                          See SAMPO-2263.                                                      */
  __IO uint32_t  TRACECONFIG;                       /*!< Clocking options for the Trace Port debug interface                   */
} NRF_CLOCK_Type;


/* ================================================================================ */
/* ================                      POWER                     ================ */
/* ================================================================================ */


/**
  * @brief Power Control (POWER)
  */

typedef struct {                                    /*!< POWER Structure                                                       */
  __I  uint32_t  RESERVED0[30];
  __O  uint32_t  TASKS_CONSTLAT;                    /*!< Enable constant latency mode. When going to sleep: CPU is clock
                                                         gated, but regulators, oscillators and clock tree is kept on.         */
  __O  uint32_t  TASKS_LOWPWR;                      /*!< Enable low power mode (variable latency) When going to sleep:
                                                         Oscillators are switched off (if nothing else is requesting
                                                          clocks). Regulators are switched off (if nothing else is requesting
                                                          power).                                                              */
  __I  uint32_t  RESERVED1[30];
  __IO uint32_t  SUBSCRIBE_CONSTLAT;                /*!< Subscribe configuration for TASKS_CONSTLAT                            */
  __IO uint32_t  SUBSCRIBE_LOWPWR;                  /*!< Subscribe configuration for TASKS_LOWPWR                              */
  __I  uint32_t  RESERVED2[2];
  __IO uint32_t  EVENTS_POFWARN;                    /*!< Power failure warning                                                 */
  __I  uint32_t  RESERVED3[2];
  __IO uint32_t  EVENTS_SLEEPENTER;                 /*!< CPU entered WFI/WFE sleep                                             */
  __IO uint32_t  EVENTS_SLEEPEXIT;                  /*!< CPU exited WFI/WFE sleep                                              */
  __I  uint32_t  RESERVED4[27];
  __IO uint32_t  PUBLISH_POFWARN;                   /*!< Publish configuration for EVENTS_POFWARN                              */
  __I  uint32_t  RESERVED5[2];
  __IO uint32_t  PUBLISH_SLEEPENTER;                /*!< Publish configuration for EVENTS_SLEEPENTER                           */
  __IO uint32_t  PUBLISH_SLEEPEXIT;                 /*!< Publish configuration for EVENTS_SLEEPEXIT                            */
  __I  uint32_t  RESERVED6[89];
  __IO uint32_t  INTEN;                             /*!< Enable or disable interrupt                                           */
  __IO uint32_t  INTENSET;                          /*!< Enable interrupt                                                      */
  __IO uint32_t  INTENCLR;                          /*!< Disable interrupt                                                     */
  __I  uint32_t  RESERVED7[61];
  __IO uint32_t  RESETREAS;                         /*!< Reset reason                                                          */
  __I  uint32_t  RESERVED8[70];
  __IO uint32_t  GPREGRET[2];                       /*!< Description collection[0]: General purpose retention register         */
  __I  uint32_t  RESERVED9[59];
  POWER_LTEMODEM_Type LTEMODEM;                     /*!< LTE Modem                                                             */
} NRF_POWER_Type;


/* ================================================================================ */
/* ================                      PAMLI                     ================ */
/* ================================================================================ */


/**
  * @brief Peripheral AHB Multi-Layer Interface (PAMLI)
  */

typedef struct {                                    /*!< PAMLI Structure                                                       */
  __I  uint32_t  RESERVED0[360];
  __IO uint32_t  BRIDGETYPE;                        /*!< Select AHB2AHB Sync Bridge Type                                       */
  __I  uint32_t  RESERVED1[535];
  PAMLI_RAMPRI_Type RAMPRI;                         /*!< RAM configurable priority configuration structure                     */
} NRF_PAMLI_Type;


