jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.h
/* ================================================================================ */
/* ================                      UARTE                     ================ */
/* ================================================================================ */


/**
  * @brief UART with EasyDMA 0 (UARTE)
  */

typedef struct {                                    /*!< UARTE Structure                                                       */
  __O  uint32_t  TASKS_STARTRX;                     /*!< Start UART receiver                                                   */
  __O  uint32_t  TASKS_STOPRX;                      /*!< Stop UART receiver                                                    */
  __O  uint32_t  TASKS_STARTTX;                     /*!< Start UART transmitter                                                */
  __O  uint32_t  TASKS_STOPTX;                      /*!< Stop UART transmitter                                                 */
  __I  uint32_t  RESERVED0[3];
  __O  uint32_t  TASKS_SUSPEND;                     /*!< Suspend UART transaction                                              */
  __O  uint32_t  TASKS_RESUME;                      /*!< Resume UART transaction                                               */
  __I  uint32_t  RESERVED1[2];
  __O  uint32_t  TASKS_FLUSHRX;                     /*!< Flush RX FIFO into RX buffer                                          */
  __I  uint32_t  RESERVED2[20];
  __IO uint32_t  SUBSCRIBE_STARTRX;                 /*!< Subscribe configuration for TASKS_STARTRX                             */
  __IO uint32_t  SUBSCRIBE_STOPRX;                  /*!< Subscribe configuration for TASKS_STOPRX                              */
  __IO uint32_t  SUBSCRIBE_STARTTX;                 /*!< Subscribe configuration for TASKS_STARTTX                             */
  __IO uint32_t  SUBSCRIBE_STOPTX;                  /*!< Subscribe configuration for TASKS_STOPTX                              */
  __I  uint32_t  RESERVED3[3];
  __IO uint32_t  SUBSCRIBE_SUSPEND;                 /*!< Subscribe configuration for TASKS_SUSPEND                             */
  __IO uint32_t  SUBSCRIBE_RESUME;                  /*!< Subscribe configuration for TASKS_RESUME                              */
  __I  uint32_t  RESERVED4[2];
  __IO uint32_t  SUBSCRIBE_FLUSHRX;                 /*!< Subscribe configuration for TASKS_FLUSHRX                             */
  __I  uint32_t  RESERVED5[20];
  __IO uint32_t  EVENTS_CTS;                        /*!< CTS is activated (set low). Clear To Send.                            */
  __IO uint32_t  EVENTS_NCTS;                       /*!< CTS is deactivated (set high). Not Clear To Send.                     */
  __IO uint32_t  EVENTS_RXDRDY;                     /*!< Data received in RXD (but potentially not yet transferred to
                                                         Data RAM)                                                             */
  __I  uint32_t  RESERVED6;
  __IO uint32_t  EVENTS_ENDRX;                      /*!< Receive buffer is filled up                                           */
  __I  uint32_t  RESERVED7[2];
  __IO uint32_t  EVENTS_TXDRDY;                     /*!< Data sent from TXD                                                    */
  __IO uint32_t  EVENTS_ENDTX;                      /*!< Last TX byte transmitted                                              */
  __IO uint32_t  EVENTS_ERROR;                      /*!< Error detected                                                        */
  __I  uint32_t  RESERVED8[7];
  __IO uint32_t  EVENTS_RXTO;                       /*!< Receiver timeout                                                      */
  __I  uint32_t  RESERVED9;
  __IO uint32_t  EVENTS_RXSTARTED;                  /*!< UART receiver has started                                             */
  __IO uint32_t  EVENTS_TXSTARTED;                  /*!< UART transmitter has started                                          */
  __IO uint32_t  EVENTS_RTS;                        /*!< RX FIFO has only room for four more bytes before it overflows         */
  __IO uint32_t  EVENTS_TXSTOPPED;                  /*!< Transmitter stopped                                                   */
  __I  uint32_t  RESERVED10[9];
  __IO uint32_t  PUBLISH_CTS;                       /*!< Publish configuration for EVENTS_CTS                                  */
  __IO uint32_t  PUBLISH_NCTS;                      /*!< Publish configuration for EVENTS_NCTS                                 */
  __IO uint32_t  PUBLISH_RXDRDY;                    /*!< Publish configuration for EVENTS_RXDRDY                               */
  __I  uint32_t  RESERVED11;
  __IO uint32_t  PUBLISH_ENDRX;                     /*!< Publish configuration for EVENTS_ENDRX                                */
  __I  uint32_t  RESERVED12[2];
  __IO uint32_t  PUBLISH_TXDRDY;                    /*!< Publish configuration for EVENTS_TXDRDY                               */
  __IO uint32_t  PUBLISH_ENDTX;                     /*!< Publish configuration for EVENTS_ENDTX                                */
  __IO uint32_t  PUBLISH_ERROR;                     /*!< Publish configuration for EVENTS_ERROR                                */
  __I  uint32_t  RESERVED13[7];
  __IO uint32_t  PUBLISH_RXTO;                      /*!< Publish configuration for EVENTS_RXTO                                 */
  __I  uint32_t  RESERVED14;
  __IO uint32_t  PUBLISH_RXSTARTED;                 /*!< Publish configuration for EVENTS_RXSTARTED                            */
  __IO uint32_t  PUBLISH_TXSTARTED;                 /*!< Publish configuration for EVENTS_TXSTARTED                            */
  __IO uint32_t  PUBLISH_RTS;                       /*!< Publish configuration for EVENTS_RTS                                  */
  __IO uint32_t  PUBLISH_TXSTOPPED;                 /*!< Publish configuration for EVENTS_TXSTOPPED                            */
  __I  uint32_t  RESERVED15[9];
  __IO uint32_t  SHORTS;                            /*!< Shortcut register                                                     */
  __I  uint32_t  RESERVED16[63];
  __IO uint32_t  INTEN;                             /*!< Enable or disable interrupt                                           */
  __IO uint32_t  INTENSET;                          /*!< Enable interrupt                                                      */
  __IO uint32_t  INTENCLR;                          /*!< Disable interrupt                                                     */
  __I  uint32_t  RESERVED17[93];
  __IO uint32_t  ERRORSRC;                          /*!< Error source Note : this register is read / write one to clear.       */
  __I  uint32_t  RESERVED18[31];
  __IO uint32_t  ENABLE;                            /*!< Enable UART                                                           */
  __I  uint32_t  RESERVED19;
  UARTE_PSEL_Type PSEL;                             /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED20[3];
  __IO uint32_t  BAUDRATE;                          /*!< Baud rate. Accuracy depends on the HFCLK source selected.             */
  __I  uint32_t  RESERVED21[3];
  UARTE_RXD_Type RXD;                               /*!< RXD EasyDMA channel                                                   */
  __I  uint32_t  RESERVED22;
  UARTE_TXD_Type TXD;                               /*!< TXD EasyDMA channel                                                   */
  __I  uint32_t  RESERVED23[7];
  __IO uint32_t  CONFIG;                            /*!< Configuration of parity and hardware flow control                     */
  __I  uint32_t  RESERVED24[675];
  __IO uint32_t  POWER;                             /*!< Peripheral power control                                              */
} NRF_UARTE_Type;


/* ================================================================================ */
/* ================                      SPIM                      ================ */
/* ================================================================================ */


/**
  * @brief Serial Peripheral Interface Master with EasyDMA 0 (SPIM)
  */

typedef struct {                                    /*!< SPIM Structure                                                        */
  __I  uint32_t  RESERVED0[4];
  __O  uint32_t  TASKS_START;                       /*!< Start SPI transaction                                                 */
  __O  uint32_t  TASKS_STOP;                        /*!< Stop SPI transaction                                                  */
  __I  uint32_t  RESERVED1;
  __O  uint32_t  TASKS_SUSPEND;                     /*!< Suspend SPI transaction                                               */
  __O  uint32_t  TASKS_RESUME;                      /*!< Resume SPI transaction                                                */
  __I  uint32_t  RESERVED2[27];
  __IO uint32_t  SUBSCRIBE_START;                   /*!< Subscribe configuration for TASKS_START                               */
  __IO uint32_t  SUBSCRIBE_STOP;                    /*!< Subscribe configuration for TASKS_STOP                                */
  __I  uint32_t  RESERVED3;
  __IO uint32_t  SUBSCRIBE_SUSPEND;                 /*!< Subscribe configuration for TASKS_SUSPEND                             */
  __IO uint32_t  SUBSCRIBE_RESUME;                  /*!< Subscribe configuration for TASKS_RESUME                              */
  __I  uint32_t  RESERVED4[24];
  __IO uint32_t  EVENTS_STOPPED;                    /*!< SPI transaction has stopped                                           */
  __I  uint32_t  RESERVED5[2];
  __IO uint32_t  EVENTS_ENDRX;                      /*!< End of RXD buffer reached                                             */
  __I  uint32_t  RESERVED6;
  __IO uint32_t  EVENTS_END;                        /*!< End of RXD buffer and TXD buffer reached                              */
  __I  uint32_t  RESERVED7;
  __IO uint32_t  EVENTS_ENDTX;                      /*!< End of TXD buffer reached                                             */
  __I  uint32_t  RESERVED8[10];
  __IO uint32_t  EVENTS_STARTED;                    /*!< Transaction started                                                   */
  __I  uint32_t  RESERVED9[13];
  __IO uint32_t  PUBLISH_STOPPED;                   /*!< Publish configuration for EVENTS_STOPPED                              */
  __I  uint32_t  RESERVED10[2];
  __IO uint32_t  PUBLISH_ENDRX;                     /*!< Publish configuration for EVENTS_ENDRX                                */
  __I  uint32_t  RESERVED11;
  __IO uint32_t  PUBLISH_END;                       /*!< Publish configuration for EVENTS_END                                  */
  __I  uint32_t  RESERVED12;
  __IO uint32_t  PUBLISH_ENDTX;                     /*!< Publish configuration for EVENTS_ENDTX                                */
  __I  uint32_t  RESERVED13[10];
  __IO uint32_t  PUBLISH_STARTED;                   /*!< Publish configuration for EVENTS_STARTED                              */
  __I  uint32_t  RESERVED14[12];
  __IO uint32_t  SHORTS;                            /*!< Shortcut register                                                     */
  __I  uint32_t  RESERVED15[63];
  __IO uint32_t  INTEN;                             /*!< Enable or disable interrupt                                           */
  __IO uint32_t  INTENSET;                          /*!< Enable interrupt                                                      */
  __IO uint32_t  INTENCLR;                          /*!< Disable interrupt                                                     */
  __I  uint32_t  RESERVED16[125];
  __IO uint32_t  ENABLE;                            /*!< Enable SPIM                                                           */
  __I  uint32_t  RESERVED17;
  SPIM_PSEL_Type PSEL;                              /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED18;
  __I  uint32_t  RXDDATA;                           /*!< RXD register                                                          */
  __IO uint32_t  TXDDATA;                           /*!< TXD register                                                          */
  __I  uint32_t  RESERVED19;
  __IO uint32_t  FREQUENCY;                         /*!< SPI frequency                                                         */
  __I  uint32_t  RESERVED20[3];
  SPIM_RXD_Type RXD;                                /*!< RXD EasyDMA channel                                                   */
  SPIM_TXD_Type TXD;                                /*!< TXD EasyDMA channel                                                   */
  __IO uint32_t  CONFIG;                            /*!< Configuration register                                                */
  __I  uint32_t  RESERVED21[26];
  __IO uint32_t  ORC;                               /*!< Over-read character. Character clocked out in case and over-read
                                                         of the TXD buffer.                                                    */
  __I  uint32_t  RESERVED22[654];
  __IO uint32_t  POWER;                             /*!< Peripheral power control                                              */
} NRF_SPIM_Type;


/* ================================================================================ */
/* ================                      SPIS                      ================ */
/* ================================================================================ */


/**
  * @brief SPI Slave 0 (SPIS)
  */

typedef struct {                                    /*!< SPIS Structure                                                        */
  __I  uint32_t  RESERVED0[9];
  __O  uint32_t  TASKS_ACQUIRE;                     /*!< Acquire SPI semaphore                                                 */
  __O  uint32_t  TASKS_RELEASE;                     /*!< Release SPI semaphore, enabling the SPI slave to acquire it           */
  __I  uint32_t  RESERVED1[30];
  __IO uint32_t  SUBSCRIBE_ACQUIRE;                 /*!< Subscribe configuration for TASKS_ACQUIRE                             */
  __IO uint32_t  SUBSCRIBE_RELEASE;                 /*!< Subscribe configuration for TASKS_RELEASE                             */
  __I  uint32_t  RESERVED2[22];
  __IO uint32_t  EVENTS_END;                        /*!< Granted transaction completed                                         */
  __I  uint32_t  RESERVED3[2];
  __IO uint32_t  EVENTS_ENDRX;                      /*!< End of RXD buffer reached                                             */
  __I  uint32_t  RESERVED4[5];
  __IO uint32_t  EVENTS_ACQUIRED;                   /*!< Semaphore acquired                                                    */
  __I  uint32_t  RESERVED5[22];
  __IO uint32_t  PUBLISH_END;                       /*!< Publish configuration for EVENTS_END                                  */
  __I  uint32_t  RESERVED6[2];
  __IO uint32_t  PUBLISH_ENDRX;                     /*!< Publish configuration for EVENTS_ENDRX                                */
  __I  uint32_t  RESERVED7[5];
  __IO uint32_t  PUBLISH_ACQUIRED;                  /*!< Publish configuration for EVENTS_ACQUIRED                             */
  __I  uint32_t  RESERVED8[21];
  __IO uint32_t  SHORTS;                            /*!< Shortcut register                                                     */
  __I  uint32_t  RESERVED9[63];
  __IO uint32_t  INTEN;                             /*!< Enable or disable interrupt                                           */
  __IO uint32_t  INTENSET;                          /*!< Enable interrupt                                                      */
  __IO uint32_t  INTENCLR;                          /*!< Disable interrupt                                                     */
  __I  uint32_t  RESERVED10[61];
  __I  uint32_t  SEMSTAT;                           /*!< Semaphore status register                                             */
  __I  uint32_t  RESERVED11[15];
  __IO uint32_t  STATUS;                            /*!< Status from last transaction                                          */
  __I  uint32_t  RESERVED12[47];
  __IO uint32_t  ENABLE;                            /*!< Enable SPI slave                                                      */
  __I  uint32_t  RESERVED13;
  SPIS_PSEL_Type PSEL;                              /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED14[7];
  SPIS_RXD_Type RXD;                                /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED15;
  SPIS_TXD_Type TXD;                                /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED16;
  __IO uint32_t  CONFIG;                            /*!< Configuration register                                                */
  __I  uint32_t  RESERVED17;
  __IO uint32_t  DEF;                               /*!< Default character. Character clocked out in case of an ignored
                                                         transaction.                                                          */
  __I  uint32_t  RESERVED18[24];
  __IO uint32_t  ORC;                               /*!< Over-read character                                                   */
  __I  uint32_t  RESERVED19[654];
  __IO uint32_t  POWER;                             /*!< Peripheral power control                                              */
} NRF_SPIS_Type;


/* ================================================================================ */
/* ================                      TWIM                      ================ */
/* ================================================================================ */


/**
  * @brief I2C compatible Two-Wire Master Interface with EasyDMA 0 (TWIM)
  */

