jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.h
typedef struct {                                    /*!< TWIM Structure                                                        */
  __O  uint32_t  TASKS_STARTRX;                     /*!< Start TWI receive sequence                                            */
  __I  uint32_t  RESERVED0;
  __O  uint32_t  TASKS_STARTTX;                     /*!< Start TWI transmit sequence                                           */
  __I  uint32_t  RESERVED1[2];
  __O  uint32_t  TASKS_STOP;                        /*!< Stop TWI transaction. Must be issued while the TWI master is
                                                         not suspended.                                                        */
  __I  uint32_t  RESERVED2;
  __O  uint32_t  TASKS_SUSPEND;                     /*!< Suspend TWI transaction                                               */
  __O  uint32_t  TASKS_RESUME;                      /*!< Resume TWI transaction                                                */
  __I  uint32_t  RESERVED3[23];
  __IO uint32_t  SUBSCRIBE_STARTRX;                 /*!< Subscribe configuration for TASKS_STARTRX                             */
  __I  uint32_t  RESERVED4;
  __IO uint32_t  SUBSCRIBE_STARTTX;                 /*!< Subscribe configuration for TASKS_STARTTX                             */
  __I  uint32_t  RESERVED5[2];
  __IO uint32_t  SUBSCRIBE_STOP;                    /*!< Subscribe configuration for TASKS_STOP                                */
  __I  uint32_t  RESERVED6;
  __IO uint32_t  SUBSCRIBE_SUSPEND;                 /*!< Subscribe configuration for TASKS_SUSPEND                             */
  __IO uint32_t  SUBSCRIBE_RESUME;                  /*!< Subscribe configuration for TASKS_RESUME                              */
  __I  uint32_t  RESERVED7[24];
  __IO uint32_t  EVENTS_STOPPED;                    /*!< TWI stopped                                                           */
  __I  uint32_t  RESERVED8[2];
  __IO uint32_t  EVENTS_ENDRX;                      /*!< End of RXD buffer access by EasyDMA                                   */
  __I  uint32_t  RESERVED9[3];
  __IO uint32_t  EVENTS_ENDTX;                      /*!< END of TXD buffer access by EasyDMA                                   */
  __IO uint32_t  EVENTS_ERROR;                      /*!< TWI error                                                             */
  __I  uint32_t  RESERVED10[4];
  __IO uint32_t  EVENTS_BB;                         /*!< TWI byte boundary, generated before each byte that is sent or
                                                         received                                                              */
  __I  uint32_t  RESERVED11[3];
  __IO uint32_t  EVENTS_SUSPENDED;                  /*!< Last byte has been sent out after the SUSPEND task has been
                                                         issued, TWI traffic is now suspended.                                 */
  __IO uint32_t  EVENTS_RXSTARTED;                  /*!< Receive sequence started                                              */
  __IO uint32_t  EVENTS_TXSTARTED;                  /*!< Transmit sequence started                                             */
  __I  uint32_t  RESERVED12[2];
  __IO uint32_t  EVENTS_LASTRX;                     /*!< Byte boundary, starting to receive the last byte                      */
  __IO uint32_t  EVENTS_LASTTX;                     /*!< Byte boundary, starting to transmit the last byte                     */
  __I  uint32_t  RESERVED13[8];
  __IO uint32_t  PUBLISH_STOPPED;                   /*!< Publish configuration for EVENTS_STOPPED                              */
  __I  uint32_t  RESERVED14[2];
  __IO uint32_t  PUBLISH_ENDRX;                     /*!< Publish configuration for EVENTS_ENDRX                                */
  __I  uint32_t  RESERVED15[3];
  __IO uint32_t  PUBLISH_ENDTX;                     /*!< Publish configuration for EVENTS_ENDTX                                */
  __IO uint32_t  PUBLISH_ERROR;                     /*!< Publish configuration for EVENTS_ERROR                                */
  __I  uint32_t  RESERVED16[4];
  __IO uint32_t  PUBLISH_BB;                        /*!< Publish configuration for EVENTS_BB                                   */
  __I  uint32_t  RESERVED17[3];
  __IO uint32_t  PUBLISH_SUSPENDED;                 /*!< Publish configuration for EVENTS_SUSPENDED                            */
  __IO uint32_t  PUBLISH_RXSTARTED;                 /*!< Publish configuration for EVENTS_RXSTARTED                            */
  __IO uint32_t  PUBLISH_TXSTARTED;                 /*!< Publish configuration for EVENTS_TXSTARTED                            */
  __I  uint32_t  RESERVED18[2];
  __IO uint32_t  PUBLISH_LASTRX;                    /*!< Publish configuration for EVENTS_LASTRX                               */
  __IO uint32_t  PUBLISH_LASTTX;                    /*!< Publish configuration for EVENTS_LASTTX                               */
  __I  uint32_t  RESERVED19[7];
  __IO uint32_t  SHORTS;                            /*!< Shortcut register                                                     */
  __I  uint32_t  RESERVED20[63];
  __IO uint32_t  INTEN;                             /*!< Enable or disable interrupt                                           */
  __IO uint32_t  INTENSET;                          /*!< Enable interrupt                                                      */
  __IO uint32_t  INTENCLR;                          /*!< Disable interrupt                                                     */
  __I  uint32_t  RESERVED21[110];
  __IO uint32_t  ERRORSRC;                          /*!< Error source                                                          */
  __I  uint32_t  RESERVED22[14];
  __IO uint32_t  ENABLE;                            /*!< Enable TWIM                                                           */
  __I  uint32_t  RESERVED23;
  TWIM_PSEL_Type PSEL;                              /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED24[5];
  __IO uint32_t  FREQUENCY;                         /*!< TWI frequency                                                         */
  __I  uint32_t  RESERVED25[3];
  TWIM_RXD_Type RXD;                                /*!< RXD EasyDMA channel                                                   */
  TWIM_TXD_Type TXD;                                /*!< TXD EasyDMA channel                                                   */
  __I  uint32_t  RESERVED26[13];
  __IO uint32_t  ADDRESS;                           /*!< Address used in the TWI transfer                                      */
  __I  uint32_t  RESERVED27[668];
  __IO uint32_t  POWER;                             /*!< Peripheral power control                                              */
} NRF_TWIM_Type;


/* ================================================================================ */
/* ================                      TWIS                      ================ */
/* ================================================================================ */


/**
  * @brief I2C compatible Two-Wire Slave Interface with EasyDMA 0 (TWIS)
  */

typedef struct {                                    /*!< TWIS Structure                                                        */
  __I  uint32_t  RESERVED0[5];
  __O  uint32_t  TASKS_STOP;                        /*!< Stop TWI transaction                                                  */
  __I  uint32_t  RESERVED1;
  __O  uint32_t  TASKS_SUSPEND;                     /*!< Suspend TWI transaction                                               */
  __O  uint32_t  TASKS_RESUME;                      /*!< Resume TWI transaction                                                */
  __I  uint32_t  RESERVED2[3];
  __O  uint32_t  TASKS_PREPARERX;                   /*!< Prepare the TWI slave to respond to a write command                   */
  __O  uint32_t  TASKS_PREPARETX;                   /*!< Prepare the TWI slave to respond to a read command                    */
  __I  uint32_t  RESERVED3[23];
  __IO uint32_t  SUBSCRIBE_STOP;                    /*!< Subscribe configuration for TASKS_STOP                                */
  __I  uint32_t  RESERVED4;
  __IO uint32_t  SUBSCRIBE_SUSPEND;                 /*!< Subscribe configuration for TASKS_SUSPEND                             */
  __IO uint32_t  SUBSCRIBE_RESUME;                  /*!< Subscribe configuration for TASKS_RESUME                              */
  __I  uint32_t  RESERVED5[3];
  __IO uint32_t  SUBSCRIBE_PREPARERX;               /*!< Subscribe configuration for TASKS_PREPARERX                           */
  __IO uint32_t  SUBSCRIBE_PREPARETX;               /*!< Subscribe configuration for TASKS_PREPARETX                           */
  __I  uint32_t  RESERVED6[19];
  __IO uint32_t  EVENTS_STOPPED;                    /*!< TWI stopped                                                           */
  __I  uint32_t  RESERVED7[7];
  __IO uint32_t  EVENTS_ERROR;                      /*!< TWI error                                                             */
  __I  uint32_t  RESERVED8[3];
  __IO uint32_t  EVENTS_NACKTX;                     /*!< NACK on TX                                                            */
  __IO uint32_t  EVENTS_BB;                         /*!< TWI byte boundary, generated before each byte that is sent or
                                                         received                                                              */
  __I  uint32_t  RESERVED9[4];
  __IO uint32_t  EVENTS_RXSTARTED;                  /*!< Receive sequence started                                              */
  __IO uint32_t  EVENTS_TXSTARTED;                  /*!< Transmit sequence started                                             */
  __I  uint32_t  RESERVED10[4];
  __IO uint32_t  EVENTS_WRITE;                      /*!< Write command received                                                */
  __IO uint32_t  EVENTS_READ;                       /*!< Read command received                                                 */
  __IO uint32_t  EVENTS_CSSTARTED;                  /*!< TWI started stretching the clock                                      */
  __IO uint32_t  EVENTS_CSSTOPPED;                  /*!< TWI stopped stretching the clock                                      */
  __I  uint32_t  RESERVED11[4];
  __IO uint32_t  PUBLISH_STOPPED;                   /*!< Publish configuration for EVENTS_STOPPED                              */
  __I  uint32_t  RESERVED12[7];
  __IO uint32_t  PUBLISH_ERROR;                     /*!< Publish configuration for EVENTS_ERROR                                */
  __I  uint32_t  RESERVED13[3];
  __IO uint32_t  PUBLISH_NACKTX;                    /*!< Publish configuration for EVENTS_NACKTX                               */
  __IO uint32_t  PUBLISH_BB;                        /*!< Publish configuration for EVENTS_BB                                   */
  __I  uint32_t  RESERVED14[4];
  __IO uint32_t  PUBLISH_RXSTARTED;                 /*!< Publish configuration for EVENTS_RXSTARTED                            */
  __IO uint32_t  PUBLISH_TXSTARTED;                 /*!< Publish configuration for EVENTS_TXSTARTED                            */
  __I  uint32_t  RESERVED15[4];
  __IO uint32_t  PUBLISH_WRITE;                     /*!< Publish configuration for EVENTS_WRITE                                */
  __IO uint32_t  PUBLISH_READ;                      /*!< Publish configuration for EVENTS_READ                                 */
  __IO uint32_t  PUBLISH_CSSTARTED;                 /*!< Publish configuration for EVENTS_CSSTARTED                            */
  __IO uint32_t  PUBLISH_CSSTOPPED;                 /*!< Publish configuration for EVENTS_CSSTOPPED                            */
  __I  uint32_t  RESERVED16[3];
  __IO uint32_t  SHORTS;                            /*!< Shortcut register                                                     */
  __I  uint32_t  RESERVED17[63];
  __IO uint32_t  INTEN;                             /*!< Enable or disable interrupt                                           */
  __IO uint32_t  INTENSET;                          /*!< Enable interrupt                                                      */
  __IO uint32_t  INTENCLR;                          /*!< Disable interrupt                                                     */
  __I  uint32_t  RESERVED18[113];
  __IO uint32_t  ERRORSRC;                          /*!< Error source                                                          */
  __I  uint32_t  MATCH;                             /*!< Status register indicating which address had a match                  */
  __I  uint32_t  PINSTATUS;                         /*!< Returns state of signals reflecting the SDA and SCL line status.
                                                         All fields will return a '0' if DEBUGENABLE is not Enabled.           */
  __I  uint32_t  RESERVED19[9];
  __IO uint32_t  ENABLE;                            /*!< Enable TWIS                                                           */
  __I  uint32_t  RESERVED20;
  TWIS_PSEL_Type PSEL;                              /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED21[9];
  TWIS_RXD_Type RXD;                                /*!< RXD EasyDMA channel                                                   */
  __I  uint32_t  RESERVED22;
  TWIS_TXD_Type TXD;                                /*!< TXD EasyDMA channel                                                   */
  __I  uint32_t  RESERVED23[14];
  __IO uint32_t  ADDRESS[2];                        /*!< Description collection[0]: TWI slave address 0                        */
  __I  uint32_t  RESERVED24;
  __IO uint32_t  CONFIG;                            /*!< Configuration register for the address match mechanism                */
  __I  uint32_t  RESERVED25[2];
  __IO uint32_t  INPUTMODE;                         /*!< Input mode                                                            */
  __IO uint32_t  DEBUGENABLE;                       /*!< Enable TWIS debug features (PINSTATUS register)                       */
  __I  uint32_t  RESERVED26[6];
  __IO uint32_t  ORC;                               /*!< Over-read character. Character sent out in case of an over-read
                                                         of the transmit buffer.                                               */
  __I  uint32_t  RESERVED27[654];
  __IO uint32_t  POWER;                             /*!< Peripheral power control                                              */
} NRF_TWIS_Type;


/* ================================================================================ */
/* ================                     GPIOTE                     ================ */
/* ================================================================================ */


/**
  * @brief GPIO Tasks and Events (GPIOTE)
  */

typedef struct {                                    /*!< GPIOTE Structure                                                      */
  __O  uint32_t  TASKS_OUT[8];                      /*!< Description collection[0]: Task for writing to pin specified
                                                         in CONFIG[0].PSEL. Action on pin is configured in CONFIG[0].POLARITY. */
  __I  uint32_t  RESERVED0[4];
  __O  uint32_t  TASKS_SET[8];                      /*!< Description collection[0]: Task for writing to pin specified
                                                         in CONFIG[0].PSEL. Action on pin is to set it high.                   */
  __I  uint32_t  RESERVED1[4];
  __O  uint32_t  TASKS_CLR[8];                      /*!< Description collection[0]: Task for writing to pin specified
                                                         in CONFIG[0].PSEL. Action on pin is to set it low.                    */
  __IO uint32_t  SUBSCRIBE_OUT[8];                  /*!< Description collection[0]: Subscribe configuration for TASKS_OUT[0]   */
  __I  uint32_t  RESERVED2[4];
  __IO uint32_t  SUBSCRIBE_SET[8];                  /*!< Description collection[0]: Subscribe configuration for TASKS_SET[0]   */
  __I  uint32_t  RESERVED3[4];
  __IO uint32_t  SUBSCRIBE_CLR[8];                  /*!< Description collection[0]: Subscribe configuration for TASKS_CLR[0]   */
  __IO uint32_t  EVENTS_IN[8];                      /*!< Description collection[0]: Event generated from pin specified
                                                         in CONFIG[0].PSEL                                                     */
  __I  uint32_t  RESERVED4[23];
  __IO uint32_t  EVENTS_PORT;                       /*!< Event generated from multiple input GPIO pins with SENSE mechanism
                                                         enabled                                                               */
  __IO uint32_t  PUBLISH_IN[8];                     /*!< Description collection[0]: Publish configuration for EVENTS_IN[0]     */
  __I  uint32_t  RESERVED5[23];
  __IO uint32_t  PUBLISH_PORT;                      /*!< Publish configuration for EVENTS_PORT                                 */
  __I  uint32_t  RESERVED6[64];
  __IO uint32_t  INTEN;                             /*!< Enable or disable interrupt                                           */
  __IO uint32_t  INTENSET;                          /*!< Enable interrupt                                                      */
  __IO uint32_t  INTENCLR;                          /*!< Disable interrupt                                                     */
  __I  uint32_t  RESERVED7[129];
  __IO uint32_t  CONFIG[8];                         /*!< Description collection[0]: Configuration for OUT[n], SET[n]
                                                         and CLR[n] tasks and IN[n] event                                      */
  __I  uint32_t  RESERVED8[52];
  __IO uint32_t  DEBOUNCE[8];                       /*!< Description collection[0]: Debounce mode for GPIOTE channel
                                                         n                                                                     */
  __I  uint32_t  RESERVED9[631];
  __IO uint32_t  POWER;                             /*!< Peripheral power control                                              */
} NRF_GPIOTE_Type;


/* ================================================================================ */
/* ================                      SAADC                     ================ */
/* ================================================================================ */


/**
  * @brief Analog to Digital Converter (SAADC)
  */

