jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.h
typedef struct {                                    /*!< SAADC Structure                                                       */
  __O  uint32_t  TASKS_START;                       /*!< Start the ADC and prepare the result buffer in RAM                    */
  __O  uint32_t  TASKS_SAMPLE;                      /*!< Take one ADC sample, if scan is enabled all channels are sampled      */
  __O  uint32_t  TASKS_STOP;                        /*!< Stop the ADC and terminate any on-going conversion                    */
  __O  uint32_t  TASKS_CALIBRATEOFFSET;             /*!< Starts offset auto-calibration                                        */
  __O  uint32_t  TASKS_CALIBRATEGAIN;               /*!< Starts gain auto-calibration                                          */
  __I  uint32_t  RESERVED0[27];
  __IO uint32_t  SUBSCRIBE_START;                   /*!< Subscribe configuration for TASKS_START                               */
  __IO uint32_t  SUBSCRIBE_SAMPLE;                  /*!< Subscribe configuration for TASKS_SAMPLE                              */
  __IO uint32_t  SUBSCRIBE_STOP;                    /*!< Subscribe configuration for TASKS_STOP                                */
  __IO uint32_t  SUBSCRIBE_CALIBRATEOFFSET;         /*!< Subscribe configuration for TASKS_CALIBRATEOFFSET                     */
  __IO uint32_t  SUBSCRIBE_CALIBRATEGAIN;           /*!< Subscribe configuration for TASKS_CALIBRATEGAIN                       */
  __I  uint32_t  RESERVED1[27];
  __IO uint32_t  EVENTS_STARTED;                    /*!< The ADC has started                                                   */
  __IO uint32_t  EVENTS_END;                        /*!< The ADC has filled up the Result buffer                               */
  __IO uint32_t  EVENTS_DONE;                       /*!< A conversion task has been completed. Depending on the mode,
                                                         multiple conversions might be needed for a result to be transferred
                                                          to RAM.                                                              */
  __IO uint32_t  EVENTS_RESULTDONE;                 /*!< A result is ready to get transferred to RAM. Result is available
                                                         in REGRESULT register                                                 */
  __IO uint32_t  EVENTS_CALIBRATEDONE;              /*!< Calibration is complete                                               */
  __IO uint32_t  EVENTS_STOPPED;                    /*!< The ADC has stopped                                                   */
  SAADC_EVENTS_CH_Type EVENTS_CH[8];                /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED2[10];
  __IO uint32_t  PUBLISH_STARTED;                   /*!< Publish configuration for EVENTS_STARTED                              */
  __IO uint32_t  PUBLISH_END;                       /*!< Publish configuration for EVENTS_END                                  */
  __IO uint32_t  PUBLISH_DONE;                      /*!< Publish configuration for EVENTS_DONE                                 */
  __IO uint32_t  PUBLISH_RESULTDONE;                /*!< Publish configuration for EVENTS_RESULTDONE                           */
  __IO uint32_t  PUBLISH_CALIBRATEDONE;             /*!< Publish configuration for EVENTS_CALIBRATEDONE                        */
  __IO uint32_t  PUBLISH_STOPPED;                   /*!< Publish configuration for EVENTS_STOPPED                              */
  SAADC_PUBLISH_CH_Type PUBLISH_CH[8];              /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED3[10];
  __IO uint32_t  SHORTS;                            /*!< Shortcut register                                                     */
  __I  uint32_t  RESERVED4[63];
  __IO uint32_t  INTEN;                             /*!< Enable or disable interrupt                                           */
  __IO uint32_t  INTENSET;                          /*!< Enable interrupt                                                      */
  __IO uint32_t  INTENCLR;                          /*!< Disable interrupt                                                     */
  __I  uint32_t  RESERVED5[61];
  __I  uint32_t  STATUS;                            /*!< Status                                                                */
  __I  uint32_t  RESERVED6[63];
  __IO uint32_t  ENABLE;                            /*!< Enable or disable ADC                                                 */
  __I  uint32_t  RESERVED7[3];
  SAADC_CH_Type CH[8];                              /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED8[23];
  __I  uint32_t  REGRESULT;                         /*!< Last conversion result                                                */
  __IO uint32_t  RESOLUTION;                        /*!< Resolution configuration                                              */
  __IO uint32_t  OVERSAMPLE;                        /*!< Oversampling configuration. OVERSAMPLE should not be combined
                                                         with SCAN. The RESOLUTION is applied before averaging, thus
                                                          for high OVERSAMPLE a higher RESOLUTION should be used.              */
  __IO uint32_t  SAMPLERATE;                        /*!< Controls normal or continuous sample rate                             */
  __I  uint32_t  RESERVED9[12];
  SAADC_RESULT_Type RESULT;                         /*!< RESULT EasyDMA channel                                                */
  __I  uint32_t  RESERVED10;
  __IO uint32_t  TESTCTRL;                          /*!< Control signals used during test of ADC                               */
  __IO uint32_t  CALOFFSET;                         /*!< Calibration control for offset error                                  */
  __IO uint32_t  CALGAIN;                           /*!< Calibration control for gain error                                    */
  __IO uint32_t  CALVREF;                           /*!< Calibration control for reference voltage                             */
  __I  uint32_t  RESERVED11[620];
  __IO uint32_t  POWER;                             /*!< Peripheral power control                                              */
} NRF_SAADC_Type;


/* ================================================================================ */
/* ================                      TIMER                     ================ */
/* ================================================================================ */


/**
  * @brief Timer/Counter 0 (TIMER)
  */

typedef struct {                                    /*!< TIMER Structure                                                       */
  __O  uint32_t  TASKS_START;                       /*!< Start Timer                                                           */
  __O  uint32_t  TASKS_STOP;                        /*!< Stop Timer                                                            */
  __O  uint32_t  TASKS_COUNT;                       /*!< Increment Timer (Counter mode only)                                   */
  __O  uint32_t  TASKS_CLEAR;                       /*!< Clear time                                                            */
  __O  uint32_t  TASKS_SHUTDOWN;                    /*!< Deprecated register - Shut down timer                                 */
  __I  uint32_t  RESERVED0[11];
  __O  uint32_t  TASKS_CAPTURE[6];                  /*!< Description collection[0]: Capture Timer value to CC[0] register      */
  __I  uint32_t  RESERVED1[10];
  __IO uint32_t  SUBSCRIBE_START;                   /*!< Subscribe configuration for TASKS_START                               */
  __IO uint32_t  SUBSCRIBE_STOP;                    /*!< Subscribe configuration for TASKS_STOP                                */
  __IO uint32_t  SUBSCRIBE_COUNT;                   /*!< Subscribe configuration for TASKS_COUNT                               */
  __IO uint32_t  SUBSCRIBE_CLEAR;                   /*!< Subscribe configuration for TASKS_CLEAR                               */
  __IO uint32_t  SUBSCRIBE_SHUTDOWN;                /*!< Subscribe configuration for TASKS_SHUTDOWN                            */
  __I  uint32_t  RESERVED2[11];
  __IO uint32_t  SUBSCRIBE_CAPTURE[6];              /*!< Description collection[0]: Subscribe configuration for TASKS_CAPTURE[0] */
  __I  uint32_t  RESERVED3[26];
  __IO uint32_t  EVENTS_COMPARE[6];                 /*!< Description collection[0]: Compare event on CC[0] match               */
  __I  uint32_t  RESERVED4[26];
  __IO uint32_t  PUBLISH_COMPARE[6];                /*!< Description collection[0]: Publish configuration for EVENTS_COMPARE[0] */
  __I  uint32_t  RESERVED5[10];
  __IO uint32_t  SHORTS;                            /*!< Shortcut register                                                     */
  __I  uint32_t  RESERVED6[64];
  __IO uint32_t  INTENSET;                          /*!< Enable interrupt                                                      */
  __IO uint32_t  INTENCLR;                          /*!< Disable interrupt                                                     */
  __I  uint32_t  RESERVED7[126];
  __IO uint32_t  MODE;                              /*!< Timer mode selection                                                  */
  __IO uint32_t  BITMODE;                           /*!< Configure the number of bits used by the TIMER                        */
  __I  uint32_t  RESERVED8;
  __IO uint32_t  PRESCALER;                         /*!< Timer prescaler register                                              */
  __I  uint32_t  RESERVED9[11];
  __IO uint32_t  CC[6];                             /*!< Description collection[0]: Capture/Compare register 0                 */
  __I  uint32_t  RESERVED10[681];
  __IO uint32_t  POWER;                             /*!< Peripheral power control                                              */
} NRF_TIMER_Type;


/* ================================================================================ */
/* ================                       RTC                      ================ */
/* ================================================================================ */


/**
  * @brief Real time counter 0 (RTC)
  */

typedef struct {                                    /*!< RTC Structure                                                         */
  __O  uint32_t  TASKS_START;                       /*!< Start RTC COUNTER                                                     */
  __O  uint32_t  TASKS_STOP;                        /*!< Stop RTC COUNTER                                                      */
  __O  uint32_t  TASKS_CLEAR;                       /*!< Clear RTC COUNTER                                                     */
  __O  uint32_t  TASKS_TRIGOVRFLW;                  /*!< Set COUNTER to 0xFFFFF0                                               */
  __I  uint32_t  RESERVED0[28];
  __IO uint32_t  SUBSCRIBE_START;                   /*!< Subscribe configuration for TASKS_START                               */
  __IO uint32_t  SUBSCRIBE_STOP;                    /*!< Subscribe configuration for TASKS_STOP                                */
  __IO uint32_t  SUBSCRIBE_CLEAR;                   /*!< Subscribe configuration for TASKS_CLEAR                               */
  __IO uint32_t  SUBSCRIBE_TRIGOVRFLW;              /*!< Subscribe configuration for TASKS_TRIGOVRFLW                          */
  __I  uint32_t  RESERVED1[28];
  __IO uint32_t  EVENTS_TICK;                       /*!< Event on COUNTER increment                                            */
  __IO uint32_t  EVENTS_OVRFLW;                     /*!< Event on COUNTER overflow                                             */
  __I  uint32_t  RESERVED2[14];
  __IO uint32_t  EVENTS_COMPARE[4];                 /*!< Description collection[0]: Compare event on CC[0] match               */
  __I  uint32_t  RESERVED3[12];
  __IO uint32_t  PUBLISH_TICK;                      /*!< Publish configuration for EVENTS_TICK                                 */
  __IO uint32_t  PUBLISH_OVRFLW;                    /*!< Publish configuration for EVENTS_OVRFLW                               */
  __I  uint32_t  RESERVED4[14];
  __IO uint32_t  PUBLISH_COMPARE[4];                /*!< Description collection[0]: Publish configuration for EVENTS_COMPARE[0] */
  __I  uint32_t  RESERVED5[76];
  __IO uint32_t  INTEN;                             /*!< Enable or disable interrupt                                           */
  __IO uint32_t  INTENSET;                          /*!< Enable interrupt                                                      */
  __IO uint32_t  INTENCLR;                          /*!< Disable interrupt                                                     */
  __I  uint32_t  RESERVED6[13];
  __IO uint32_t  EVTEN;                             /*!< Enable or disable event routing                                       */
  __IO uint32_t  EVTENSET;                          /*!< Enable event routing                                                  */
  __IO uint32_t  EVTENCLR;                          /*!< Disable event routing                                                 */
  __I  uint32_t  RESERVED7[110];
  __I  uint32_t  COUNTER;                           /*!< Current COUNTER value                                                 */
  __IO uint32_t  PRESCALER;                         /*!< 12 bit prescaler for COUNTER frequency (32768/(PRESCALER+1)).Must
                                                         be written when RTC is stopped                                        */
  __I  uint32_t  RESERVED8[13];
  __IO uint32_t  CC[4];                             /*!< Description collection[0]: Compare register 0                         */
  __I  uint32_t  RESERVED9[683];
  __IO uint32_t  POWER;                             /*!< Peripheral power control                                              */
} NRF_RTC_Type;


/* ================================================================================ */
/* ================                      DPPIC                     ================ */
/* ================================================================================ */


/**
  * @brief Distributed Programmable Peripheral Interconnect Controller (DPPIC)
  */

