jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.h
typedef struct {                                    /*!< DPPIC Structure                                                       */
  DPPIC_TASKS_CHG_Type TASKS_CHG[6];                /*!< Channel group tasks                                                   */
  __I  uint32_t  RESERVED0[20];
  DPPIC_SUBSCRIBE_CHG_Type SUBSCRIBE_CHG[6];        /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED1[276];
  __IO uint32_t  CHEN;                              /*!< Channel enable register                                               */
  __IO uint32_t  CHENSET;                           /*!< Channel enable set register                                           */
  __IO uint32_t  CHENCLR;                           /*!< Channel enable clear register                                         */
  __I  uint32_t  RESERVED2[189];
  __IO uint32_t  CHG[6];                            /*!< Description collection[0]: Channel group 0                            */
} NRF_DPPIC_Type;


/* ================================================================================ */
/* ================                      NFCT                      ================ */
/* ================================================================================ */


/**
  * @brief NFC-A compatible radio (NFCT)
  */

typedef struct {                                    /*!< NFCT Structure                                                        */
  __O  uint32_t  TASKS_ACTIVATE;                    /*!< Activate NFC peripheral for incoming and outgoing frames, change
                                                         state to activated                                                    */
  __O  uint32_t  TASKS_DISABLE;                     /*!< Disable NFC peripheral                                                */
  __O  uint32_t  TASKS_SENSE;                       /*!< Enable NFC sense field mode, change state to sense mode               */
  __O  uint32_t  TASKS_STARTTX;                     /*!< Start transmission of a outgoing frame, change state to transmit      */
  __O  uint32_t  TASKS_STOPTX;                      /*!< Stops a issued transmission of a frame                                */
  __O  uint32_t  TASKS_START_ROSCCAL;               /*!< Starts calibration of ring oscillator                                 */
  __O  uint32_t  TASKS_FREQMEASURE;                 /*!< Measures the 13.56 MHz clock frequency                                */
  __O  uint32_t  TASKS_ENABLERXDATA;                /*!< Initializes the EasyDMA for receive.                                  */
  __O  uint32_t  TASKS_DISABLERXDATA;               /*!< Ends current EasyDMA transfer and stops waiting for SoF               */
  __O  uint32_t  TASKS_GOIDLE;                      /*!< Force state machine to IDLE state                                     */
  __O  uint32_t  TASKS_GOSLEEP;                     /*!< Force state machine to SLEEP_A state                                  */
  __I  uint32_t  RESERVED0[21];
  __IO uint32_t  SUBSCRIBE_ACTIVATE;                /*!< Subscribe configuration for TASKS_ACTIVATE                            */
  __IO uint32_t  SUBSCRIBE_DISABLE;                 /*!< Subscribe configuration for TASKS_DISABLE                             */
  __IO uint32_t  SUBSCRIBE_SENSE;                   /*!< Subscribe configuration for TASKS_SENSE                               */
  __IO uint32_t  SUBSCRIBE_STARTTX;                 /*!< Subscribe configuration for TASKS_STARTTX                             */
  __IO uint32_t  SUBSCRIBE_STOPTX;                  /*!< Subscribe configuration for TASKS_STOPTX                              */
  __IO uint32_t  SUBSCRIBE_START_ROSCCAL;           /*!< Subscribe configuration for TASKS_START_ROSCCAL                       */
  __IO uint32_t  SUBSCRIBE_FREQMEASURE;             /*!< Subscribe configuration for TASKS_FREQMEASURE                         */
  __IO uint32_t  SUBSCRIBE_ENABLERXDATA;            /*!< Subscribe configuration for TASKS_ENABLERXDATA                        */
  __IO uint32_t  SUBSCRIBE_DISABLERXDATA;           /*!< Subscribe configuration for TASKS_DISABLERXDATA                       */
  __IO uint32_t  SUBSCRIBE_GOIDLE;                  /*!< Subscribe configuration for TASKS_GOIDLE                              */
  __IO uint32_t  SUBSCRIBE_GOSLEEP;                 /*!< Subscribe configuration for TASKS_GOSLEEP                             */
  __I  uint32_t  RESERVED1[21];
  __IO uint32_t  EVENTS_READY;                      /*!< The NFC peripheral is ready to receive and send frames                */
  __IO uint32_t  EVENTS_FIELDDETECTED;              /*!< Remote NFC field detected                                             */
  __IO uint32_t  EVENTS_FIELDLOST;                  /*!< Remote NFC field lost                                                 */
  __IO uint32_t  EVENTS_TXFRAMESTART;               /*!< Marks the start of the first symbol of a transmitted frame            */
  __IO uint32_t  EVENTS_TXFRAMEEND;                 /*!< Marks the end of the last transmitted on-air symbol of a frame
                                                         data bit on the last positive edge ckTxNfc with nfcTransmit
                                                          = 1                                                                  */
  __IO uint32_t  EVENTS_RXFRAMESTART;               /*!< Marks the end of the first symbol of a received frame                 */
  __IO uint32_t  EVENTS_RXFRAMEEND;                 /*!< Received data have been checked (CRC, parity) and transferred
                                                         to RAM, and EasyDMA has ended accessing the RX buffer                 */
  __IO uint32_t  EVENTS_ERROR;                      /*!< NFC error reported. The ERRORSTATUS register contains details
                                                         on the source of the error.                                           */
  __IO uint32_t  EVENTS_FREQMEASUREDONE;            /*!< Done with one frequency measurement, result available in the
                                                         MEASUREDFREQ register. This event will fire several times during
                                                          calibration.                                                         */
  __IO uint32_t  EVENTS_CALCOMPLETE;                /*!< NFC ring oscillator calibration complete.                             */
  __IO uint32_t  EVENTS_RXERROR;                    /*!< NFC RX frame error reported. The FRAMESTATUS.RX register contains
                                                         details on the source of the error.                                   */
  __IO uint32_t  EVENTS_ENDRX;                      /*!< RX buffer (as defined by PACKETPTR and MAXLEN) in Data RAM full.      */
  __IO uint32_t  EVENTS_ENDTX;                      /*!< Transmission of data in RAM has ended, and EasyDMA has ended
                                                         accessing the TX buffer                                               */
  __I  uint32_t  RESERVED2;
  __IO uint32_t  EVENTS_AUTOCOLRESSTARTED;          /*!< Auto collision resolution process has started Event generated
                                                         when ALL_REQ or SENS_REQ has been received while is IDLE state        */
  __IO uint32_t  EVENTS_AUTOCOLRES1;                /*!< Auto collision resolution cascade level 1 succeeded                   */
  __IO uint32_t  EVENTS_AUTOCOLRES2;                /*!< Auto collision resolution cascade level 2 succeeded                   */
  __IO uint32_t  EVENTS_AUTOCOLRES3;                /*!< Auto collision resolution cascade level 3 succeeded                   */
  __IO uint32_t  EVENTS_COLLISION;                  /*!< NFC Auto collision resolution error reported. The AUTOCOLRESSTATUS
                                                         register contains details on the source of the error.                 */
  __IO uint32_t  EVENTS_SELECTED;                   /*!< NFC Auto collision resolution successfully completed                  */
  __IO uint32_t  EVENTS_STARTED;                    /*!< EasyDMA is ready to receive or send frames.                           */
  __I  uint32_t  RESERVED3[11];
  __IO uint32_t  PUBLISH_READY;                     /*!< Publish configuration for EVENTS_READY                                */
  __IO uint32_t  PUBLISH_FIELDDETECTED;             /*!< Publish configuration for EVENTS_FIELDDETECTED                        */
  __IO uint32_t  PUBLISH_FIELDLOST;                 /*!< Publish configuration for EVENTS_FIELDLOST                            */
  __IO uint32_t  PUBLISH_TXFRAMESTART;              /*!< Publish configuration for EVENTS_TXFRAMESTART                         */
  __IO uint32_t  PUBLISH_TXFRAMEEND;                /*!< Publish configuration for EVENTS_TXFRAMEEND                           */
  __IO uint32_t  PUBLISH_RXFRAMESTART;              /*!< Publish configuration for EVENTS_RXFRAMESTART                         */
  __IO uint32_t  PUBLISH_RXFRAMEEND;                /*!< Publish configuration for EVENTS_RXFRAMEEND                           */
  __IO uint32_t  PUBLISH_ERROR;                     /*!< Publish configuration for EVENTS_ERROR                                */
  __IO uint32_t  PUBLISH_FREQMEASUREDONE;           /*!< Publish configuration for EVENTS_FREQMEASUREDONE                      */
  __IO uint32_t  PUBLISH_CALCOMPLETE;               /*!< Publish configuration for EVENTS_CALCOMPLETE                          */
  __IO uint32_t  PUBLISH_RXERROR;                   /*!< Publish configuration for EVENTS_RXERROR                              */
  __IO uint32_t  PUBLISH_ENDRX;                     /*!< Publish configuration for EVENTS_ENDRX                                */
  __IO uint32_t  PUBLISH_ENDTX;                     /*!< Publish configuration for EVENTS_ENDTX                                */
  __I  uint32_t  RESERVED4;
  __IO uint32_t  PUBLISH_AUTOCOLRESSTARTED;         /*!< Publish configuration for EVENTS_AUTOCOLRESSTARTED                    */
  __IO uint32_t  PUBLISH_AUTOCOLRES1;               /*!< Publish configuration for EVENTS_AUTOCOLRES1                          */
  __IO uint32_t  PUBLISH_AUTOCOLRES2;               /*!< Publish configuration for EVENTS_AUTOCOLRES2                          */
  __IO uint32_t  PUBLISH_AUTOCOLRES3;               /*!< Publish configuration for EVENTS_AUTOCOLRES3                          */
  __IO uint32_t  PUBLISH_COLLISION;                 /*!< Publish configuration for EVENTS_COLLISION                            */
  __IO uint32_t  PUBLISH_SELECTED;                  /*!< Publish configuration for EVENTS_SELECTED                             */
  __IO uint32_t  PUBLISH_STARTED;                   /*!< Publish configuration for EVENTS_STARTED                              */
  __I  uint32_t  RESERVED5[11];
  __IO uint32_t  SHORTS;                            /*!< Shortcut register                                                     */
  __I  uint32_t  RESERVED6[63];
  __IO uint32_t  INTEN;                             /*!< Enable or disable interrupt                                           */
  __IO uint32_t  INTENSET;                          /*!< Enable interrupt                                                      */
  __IO uint32_t  INTENCLR;                          /*!< Disable interrupt                                                     */
  __I  uint32_t  RESERVED7[61];
  __I  uint32_t  PWRUPSENSE;                        /*!< Tells if the NFCT peripheral is in SENSE mode                         */
  __IO uint32_t  ERRORSTATUS;                       /*!< NFC Error Status register                                             */
  __IO uint32_t  AUTOCOLRESSTATUS;                  /*!< NFC Auto collision resolution Error Status register                   */
  NFCT_FRAMESTATUS_Type FRAMESTATUS;                /*!< Unspecified                                                           */
  __I  uint32_t  NFCTAGSTATE;                       /*!< NfcTag state register                                                 */
  __I  uint32_t  RESERVED8[3];
  __I  uint32_t  DEFAULTSTATESLEEP;                 /*!< Reflects the default state during automatic collision resolution      */
  __I  uint32_t  BYTESWRITTENTORAM;                 /*!< Number of bytes written to RAM                                        */
  __I  uint32_t  NFCFRAMINGCORESTATE;               /*!< NFC Framing Core State                                                */
  __IO uint32_t  NFCANTICOLRESSTATE;                /*!< Automatic collision resolution (anti-collision) state                 */
  __I  uint32_t  RESERVED9;
  __I  uint32_t  MEASUREDFREQ;                      /*!< The frequency measured on the 13.56 MHz NFC carrier signal            */
  __I  uint32_t  ROSCCALVALUE;                      /*!< The current value used by the ring oscillator                         */
  __I  uint32_t  FIELDPRESENT;                      /*!< Indicates the presence or not of a valid field                        */
  __I  uint32_t  CURRENTPEAKDETECTREF;              /*!< Current peak detect reference                                         */
  __I  uint32_t  RESERVED10[47];
  __IO uint32_t  ENABLE;                            /*!< Register to enable NFC functionality                                  */
  __IO uint32_t  FRAMEDELAYMIN;                     /*!< Minimum frame delay                                                   */
  __IO uint32_t  FRAMEDELAYMAX;                     /*!< Maximum frame delay                                                   */
  __IO uint32_t  FRAMEDELAYMODE;                    /*!< Configuration register for the Frame Delay Timer                      */
  __IO uint32_t  PACKETPTR;                         /*!< Packet pointer for TXD and RXD data storage in Data RAM               */
  __IO uint32_t  MAXLEN;                            /*!< Size of allocated for TXD and RXD data storage buffer in Data
                                                         RAM                                                                   */
  NFCT_TXD_Type TXD;                                /*!< Unspecified                                                           */
  NFCT_RXD_Type RXD;                                /*!< Unspecified                                                           */
  __IO uint32_t  FRAMEDELAYSHIFT;                   /*!< Correction for the frame delay reference                              */
  __I  uint32_t  RESERVED11;
  __IO uint32_t  CRCPOLY;                           /*!< CRC polynomial                                                        */
  __IO uint32_t  CRCINIT;                           /*!< CRC initial value                                                     */
  __I  uint32_t  RESERVED12[22];
  __IO uint32_t  NFCID1_LAST;                       /*!< Last NFCID1 part (4, 7 or 10 bytes ID)                                */
  __IO uint32_t  NFCID1_2ND_LAST;                   /*!< Second last NFCID1 part (7 or 10 bytes ID)                            */
  __IO uint32_t  NFCID1_3RD_LAST;                   /*!< Third last NFCID1 part (10 bytes ID)                                  */
  __IO uint32_t  AUTOCOLRESCONFIG;                  /*!< Controls the Auto collision resolution function. This setting
                                                         must be done before the NFCT peripheral is enabled.                   */
  __IO uint32_t  SENSRES;                           /*!< NFC-A SENS_RES auto-response settings                                 */
  __IO uint32_t  SELRES;                            /*!< NFC-A SEL_RES auto-response settings                                  */
  __I  uint32_t  RESERVED13[22];
  __IO uint32_t  UNUSED0;                           /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED14[6];
  __IO uint32_t  DEMODCONFIG;                       /*!< Configuration settings for demodulation                               */
  __IO uint32_t  FIELDDETECTCONFIG;                 /*!< Configuration for NFCT_FIELDDETECT_TSMC55N                            */
  __IO uint32_t  ANALOGTESTBUSEN;                   /*!< Analog Testbus Enable - ATB0 only                                     */
  __IO uint32_t  SYMBOLTOLLOWER;                    /*!< Configuration register for the tolerance of the received NFC
                                                         pulse width                                                           */
  __IO uint32_t  SYMBOLTOLUPPER;                    /*!< Configuration register for the tolerance of the received NFC
                                                         pulse width                                                           */
  __IO uint32_t  CONTINUOUSSUBCARRIER;              /*!< Selects continuous sub-carrier transmission                           */
  __I  uint32_t  RESERVED15[2];
  __IO uint32_t  CLOCKRECCONFIG;                    /*!< Configuration for NFCT_CLOCKREC_TSMC55N                               */
  __IO uint32_t  CLOCKSOURCE;                       /*!< Deprecated register - Clock source                                    */
  __IO uint32_t  FRAMECONTENT1;                     /*!< Deprecated register - Buffer for custom-frame autoresponse frame-content,
                                                         when no DMA is available                                              */
  __IO uint32_t  FRAMECONTENT2;                     /*!< Deprecated register - Buffer for custom-frame autoresponse,
                                                         when no DMA is available                                              */
  __I  uint32_t  RESERVED16;
  __IO uint32_t  OVERRIDEENABLE;                    /*!< Enables override functionality. Override values for the 2V2
                                                         clamp, 3V6 clamp and loadControl value are blocked if the NFCPADS
                                                          bit of the UICR is set to 0. They are also blocked if the design
                                                          is in a testmode other than nfc ana1, nfc ana2, nfc fpga.            */
  __I  uint32_t  RESERVED17[3];
  __IO uint32_t  OVRVALPWRUPNFC;                    /*!< Override value for pwrupNfc                                           */
  __IO uint32_t  OVRVALMODULATION;                  /*!< Override value for modulation on/off                                  */
  __IO uint32_t  OVRVALLOADINACTIVE;                /*!< Override value for the load control when modulation is off            */
  __IO uint32_t  OVRVALLOADACTIVE;                  /*!< Override value for the load control when modulation is on             */
  __IO uint32_t  OVRVALPWRUPRES;                    /*!< Override value for power up resistor in the analog pad                */
  __IO uint32_t  OVRVALROSCCALCODE;                 /*!< Override value for the calibration word for the oscillator            */
  __IO uint32_t  OVRVALROSCCALEN;                   /*!< Override value for the signal CALEN going to the oscillator           */
  __IO uint32_t  OVRVALCLAMPEN2V2;                  /*!< Override value for the 2V2 clamp                                      */
  __IO uint32_t  OVRVALCLAMPEN3V6;                  /*!< Override value for the 3V6 clamp                                      */
  __IO uint32_t  AUTOCAL;                           /*!< Controls auto-calibration at NFCT module enabling                     */
  __I  uint32_t  RESERVED18;
  __IO uint32_t  SHUNTREGCONFIG;                    /*!< Configuration for NFCT_SHUNTREG_TSMC55N                               */
  __IO uint32_t  LOADMODCONFIG;                     /*!< Configuration for load modulation                                     */
  __IO uint32_t  SHUNTNMOSADJUST;                   /*!< Size adjustment for the shunt NMOS in shunt regulator                 */
  __IO uint32_t  RSHUNTCTRL;                        /*!< Adjust internal shunt resistance                                      */
  __IO uint32_t  OVRVALPEAKDETECTREF;               /*!< Override value for the peak detect reference voltage                  */
  __IO uint32_t  LOCKDETECTWINDOW;                  /*!< Adjust window size on falling edge of lock detect filter used
                                                         for demodulation                                                      */
  __I  uint32_t  RESERVED19[598];
  __IO uint32_t  POWER;                             /*!< Peripheral power control                                              */
} NRF_NFCT_Type;


/* ================================================================================ */
/* ================                       WDT                      ================ */
/* ================================================================================ */


/**
  * @brief Watchdog Timer (WDT)
  */

typedef struct {                                    /*!< WDT Structure                                                         */
  __O  uint32_t  TASKS_START;                       /*!< Start the watchdog                                                    */
  __O  uint32_t  TASKS_STOP;                        /*!< Stop the watchdog timer. Only available in timer mode.                */
  __I  uint32_t  RESERVED0[30];
  __IO uint32_t  SUBSCRIBE_START;                   /*!< Subscribe configuration for TASKS_START                               */
  __IO uint32_t  SUBSCRIBE_STOP;                    /*!< Subscribe configuration for TASKS_STOP                                */
  __I  uint32_t  RESERVED1[30];
  __IO uint32_t  EVENTS_TIMEOUT;                    /*!< Watchdog timeout                                                      */
  __I  uint32_t  RESERVED2[31];
  __IO uint32_t  PUBLISH_TIMEOUT;                   /*!< Publish configuration for EVENTS_TIMEOUT                              */
  __I  uint32_t  RESERVED3[96];
  __IO uint32_t  INTENSET;                          /*!< Enable interrupt                                                      */
  __IO uint32_t  INTENCLR;                          /*!< Disable interrupt                                                     */
  __I  uint32_t  RESERVED4[61];
  __I  uint32_t  RUNSTATUS;                         /*!< Run status                                                            */
  __I  uint32_t  REQSTATUS;                         /*!< Request status                                                        */
  __I  uint32_t  RCNT;                              /*!< Reload count                                                          */
  __I  uint32_t  RESERVED5[62];
  __IO uint32_t  CRV;                               /*!< Counter reload value                                                  */
  __IO uint32_t  RREN;                              /*!< Enable register for reload request registers                          */
  __IO uint32_t  CONFIG;                            /*!< Configuration register                                                */
  __IO uint32_t  RRKEY;                             /*!< Reload request key                                                    */
  __I  uint32_t  RESERVED6[59];
  __O  uint32_t  RR[8];                             /*!< Description collection[0]: Reload request 0                           */
  __I  uint32_t  RESERVED7[631];
  __IO uint32_t  POWER;                             /*!< Peripheral power control                                              */
} NRF_WDT_Type;


