jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.h
/* ================================================================================ */
/* ================                      QDEC                      ================ */
/* ================================================================================ */


/**
  * @brief Quadrature Decoder (QDEC)
  */

typedef struct {                                    /*!< QDEC Structure                                                        */
  __O  uint32_t  TASKS_START;                       /*!< Task starting the quadrature decoder                                  */
  __O  uint32_t  TASKS_STOP;                        /*!< Task stopping the quadrature decoder                                  */
  __O  uint32_t  TASKS_READCLRACC;                  /*!< Read and clear ACC and ACCDBL                                         */
  __O  uint32_t  TASKS_RDCLRACC;                    /*!< Read and clear ACC                                                    */
  __O  uint32_t  TASKS_RDCLRDBL;                    /*!< Read and clear ACCDBL                                                 */
  __I  uint32_t  RESERVED0[27];
  __IO uint32_t  SUBSCRIBE_START;                   /*!< Subscribe configuration for TASKS_START                               */
  __IO uint32_t  SUBSCRIBE_STOP;                    /*!< Subscribe configuration for TASKS_STOP                                */
  __IO uint32_t  SUBSCRIBE_READCLRACC;              /*!< Subscribe configuration for TASKS_READCLRACC                          */
  __IO uint32_t  SUBSCRIBE_RDCLRACC;                /*!< Subscribe configuration for TASKS_RDCLRACC                            */
  __IO uint32_t  SUBSCRIBE_RDCLRDBL;                /*!< Subscribe configuration for TASKS_RDCLRDBL                            */
  __I  uint32_t  RESERVED1[27];
  __IO uint32_t  EVENTS_SAMPLERDY;                  /*!< Event being generated for every new sample value written to
                                                         the SAMPLE register                                                   */
  __IO uint32_t  EVENTS_REPORTRDY;                  /*!< Non-null report ready                                                 */
  __IO uint32_t  EVENTS_ACCOF;                      /*!< ACC or ACCDBL register overflow                                       */
  __IO uint32_t  EVENTS_DBLRDY;                     /*!< Double displacement(s) detected                                       */
  __IO uint32_t  EVENTS_STOPPED;                    /*!< QDEC has been stopped                                                 */
  __I  uint32_t  RESERVED2[27];
  __IO uint32_t  PUBLISH_SAMPLERDY;                 /*!< Publish configuration for EVENTS_SAMPLERDY                            */
  __IO uint32_t  PUBLISH_REPORTRDY;                 /*!< Publish configuration for EVENTS_REPORTRDY                            */
  __IO uint32_t  PUBLISH_ACCOF;                     /*!< Publish configuration for EVENTS_ACCOF                                */
  __IO uint32_t  PUBLISH_DBLRDY;                    /*!< Publish configuration for EVENTS_DBLRDY                               */
  __IO uint32_t  PUBLISH_STOPPED;                   /*!< Publish configuration for EVENTS_STOPPED                              */
  __I  uint32_t  RESERVED3[27];
  __IO uint32_t  SHORTS;                            /*!< Shortcut register                                                     */
  __I  uint32_t  RESERVED4[63];
  __IO uint32_t  INTEN;                             /*!< Enable or disable interrupt                                           */
  __IO uint32_t  INTENSET;                          /*!< Enable interrupt                                                      */
  __IO uint32_t  INTENCLR;                          /*!< Disable interrupt                                                     */
  __I  uint32_t  RESERVED5[125];
  __IO uint32_t  ENABLE;                            /*!< Enable the quadrature decoder                                         */
  __IO uint32_t  LEDPOL;                            /*!< LED output pin polarity                                               */
  __IO uint32_t  SAMPLEPER;                         /*!< Sample period                                                         */
  __I  int32_t   SAMPLE;                            /*!< Motion sample value                                                   */
  __IO uint32_t  REPORTPER;                         /*!< Number of samples to be taken before REPORTRDY and DBLRDY events
                                                         can be generated                                                      */
  __I  int32_t   ACC;                               /*!< Register accumulating the valid transitions                           */
  __I  int32_t   ACCREAD;                           /*!< Snapshot of the ACC register, updated by the READCLRACC or RDCLRACC
                                                         task                                                                  */
  QDEC_PSEL_Type PSEL;                              /*!< Unspecified                                                           */
  __IO uint32_t  DBFEN;                             /*!< Enable input debounce filters                                         */
  __I  uint32_t  RESERVED6[5];
  __IO uint32_t  LEDPRE;                            /*!< Time period the LED is switched ON prior to sampling                  */
  __I  uint32_t  ACCDBL;                            /*!< Register accumulating the number of detected double transitions       */
  __I  uint32_t  ACCDBLREAD;                        /*!< Snapshot of the ACCDBL, updated by the READCLRACC or RDCLRDBL
                                                         task                                                                  */
  __I  uint32_t  RESERVED7[684];
  __IO uint32_t  POWER;                             /*!< Peripheral power control                                              */
} NRF_QDEC_Type;


/* ================================================================================ */
/* ================                      COMP                      ================ */
/* ================================================================================ */


/**
  * @brief Comparator (COMP)
  */

typedef struct {                                    /*!< COMP Structure                                                        */
  __O  uint32_t  TASKS_START;                       /*!< Start comparator                                                      */
  __O  uint32_t  TASKS_STOP;                        /*!< Stop comparator                                                       */
  __O  uint32_t  TASKS_SAMPLE;                      /*!< Sample comparator value                                               */
  __I  uint32_t  RESERVED0[29];
  __IO uint32_t  SUBSCRIBE_START;                   /*!< Subscribe configuration for TASKS_START                               */
  __IO uint32_t  SUBSCRIBE_STOP;                    /*!< Subscribe configuration for TASKS_STOP                                */
  __IO uint32_t  SUBSCRIBE_SAMPLE;                  /*!< Subscribe configuration for TASKS_SAMPLE                              */
  __I  uint32_t  RESERVED1[29];
  __IO uint32_t  EVENTS_READY;                      /*!< COMP is ready and output is valid                                     */
  __IO uint32_t  EVENTS_DOWN;                       /*!< Downward crossing                                                     */
  __IO uint32_t  EVENTS_UP;                         /*!< Upward crossing                                                       */
  __IO uint32_t  EVENTS_CROSS;                      /*!< Downward or upward crossing                                           */
  __I  uint32_t  RESERVED2[28];
  __IO uint32_t  PUBLISH_READY;                     /*!< Publish configuration for EVENTS_READY                                */
  __IO uint32_t  PUBLISH_DOWN;                      /*!< Publish configuration for EVENTS_DOWN                                 */
  __IO uint32_t  PUBLISH_UP;                        /*!< Publish configuration for EVENTS_UP                                   */
  __IO uint32_t  PUBLISH_CROSS;                     /*!< Publish configuration for EVENTS_CROSS                                */
  __I  uint32_t  RESERVED3[28];
  __IO uint32_t  SHORTS;                            /*!< Shortcut register                                                     */
  __I  uint32_t  RESERVED4[63];
  __IO uint32_t  INTEN;                             /*!< Enable or disable interrupt                                           */
  __IO uint32_t  INTENSET;                          /*!< Enable interrupt                                                      */
  __IO uint32_t  INTENCLR;                          /*!< Disable interrupt                                                     */
  __I  uint32_t  RESERVED5[61];
  __I  uint32_t  RESULT;                            /*!< Compare result                                                        */
  __I  uint32_t  BGREADY;                           /*!< COMP module is ready                                                  */
  __I  uint32_t  RESERVED6[62];
  __IO uint32_t  ENABLE;                            /*!< COMP enable                                                           */
  __IO uint32_t  PSEL;                              /*!< Pin select                                                            */
  __IO uint32_t  REFSEL;                            /*!< Reference source select                                               */
  __IO uint32_t  EXTREFSEL;                         /*!< External reference select                                             */
  __I  uint32_t  RESERVED7[8];
  __IO uint32_t  TH;                                /*!< Threshold configuration for hysteresis unit                           */
  __IO uint32_t  MODE;                              /*!< Mode configuration                                                    */
  __IO uint32_t  HYST;                              /*!< Comparator hysteresis enable                                          */
  __IO uint32_t  ISOURCE;                           /*!< Current source select on analog input                                 */
  __IO uint32_t  REFTRIM;                           /*!< Trim internal band gap reference, copied from FICR (COMPREFTRIM
                                                         register) at reset                                                    */
  __IO uint32_t  ATECOMP;                           /*!< Analog test bus control for comparator                                */
  __I  uint32_t  RESERVED8[685];
  __IO uint32_t  POWER;                             /*!< Peripheral power control                                              */
} NRF_COMP_Type;


/* ================================================================================ */
/* ================                     LPCOMP                     ================ */
/* ================================================================================ */


/**
  * @brief Low Power Comparator (LPCOMP)
  */

typedef struct {                                    /*!< LPCOMP Structure                                                      */
  __O  uint32_t  TASKS_START;                       /*!< Start comparator                                                      */
  __O  uint32_t  TASKS_STOP;                        /*!< Stop comparator                                                       */
  __O  uint32_t  TASKS_SAMPLE;                      /*!< Sample comparator value                                               */
  __I  uint32_t  RESERVED0[29];
  __IO uint32_t  SUBSCRIBE_START;                   /*!< Subscribe configuration for TASKS_START                               */
  __IO uint32_t  SUBSCRIBE_STOP;                    /*!< Subscribe configuration for TASKS_STOP                                */
  __IO uint32_t  SUBSCRIBE_SAMPLE;                  /*!< Subscribe configuration for TASKS_SAMPLE                              */
  __I  uint32_t  RESERVED1[29];
  __IO uint32_t  EVENTS_READY;                      /*!< LPCOMP is ready and output is valid                                   */
  __IO uint32_t  EVENTS_DOWN;                       /*!< Downward crossing                                                     */
  __IO uint32_t  EVENTS_UP;                         /*!< Upward crossing                                                       */
  __IO uint32_t  EVENTS_CROSS;                      /*!< Downward or upward crossing                                           */
  __I  uint32_t  RESERVED2[28];
  __IO uint32_t  PUBLISH_READY;                     /*!< Publish configuration for EVENTS_READY                                */
  __IO uint32_t  PUBLISH_DOWN;                      /*!< Publish configuration for EVENTS_DOWN                                 */
  __IO uint32_t  PUBLISH_UP;                        /*!< Publish configuration for EVENTS_UP                                   */
  __IO uint32_t  PUBLISH_CROSS;                     /*!< Publish configuration for EVENTS_CROSS                                */
  __I  uint32_t  RESERVED3[28];
  __IO uint32_t  SHORTS;                            /*!< Shortcut register                                                     */
  __I  uint32_t  RESERVED4[63];
  __IO uint32_t  INTEN;                             /*!< Enable or disable interrupt                                           */
  __IO uint32_t  INTENSET;                          /*!< Enable interrupt                                                      */
  __IO uint32_t  INTENCLR;                          /*!< Disable interrupt                                                     */
  __I  uint32_t  RESERVED5[61];
  __I  uint32_t  RESULT;                            /*!< Compare result                                                        */
  __I  uint32_t  RESERVED6[63];
  __IO uint32_t  ENABLE;                            /*!< Enable LPCOMP                                                         */
  __IO uint32_t  PSEL;                              /*!< Input pin select                                                      */
  __IO uint32_t  REFSEL;                            /*!< Reference select                                                      */
  __IO uint32_t  EXTREFSEL;                         /*!< External reference select                                             */
  __I  uint32_t  RESERVED7[4];
  __IO uint32_t  ANADETECT;                         /*!< Analog detect configuration                                           */
  __I  uint32_t  RESERVED8[5];
  __IO uint32_t  HYST;                              /*!< Comparator hysteresis enable                                          */
  __I  uint32_t  RESERVED9[688];
  __IO uint32_t  POWER;                             /*!< Peripheral power control                                              */
} NRF_LPCOMP_Type;


/* ================================================================================ */
/* ================                       SWI                      ================ */
/* ================================================================================ */


/**
  * @brief Software interrupt (SWI)
  */

typedef struct {                                    /*!< SWI Structure                                                         */
  __I  uint32_t  UNUSED;                            /*!< Unused.                                                               */
} NRF_SWI_Type;


/* ================================================================================ */
/* ================                       EGU                      ================ */
/* ================================================================================ */


/**
  * @brief Event Generator Unit (EGU)
  */

typedef struct {                                    /*!< EGU Structure                                                         */
  __O  uint32_t  TASKS_TRIGGER[16];                 /*!< Description collection[0]: Trigger 0 for triggering the corresponding
                                                         TRIGGERED[0] event                                                    */
  __I  uint32_t  RESERVED0[16];
  __IO uint32_t  SUBSCRIBE_TRIGGER[16];             /*!< Description collection[0]: Subscribe configuration for TASKS_TRIGGER[0] */
  __I  uint32_t  RESERVED1[16];
  __IO uint32_t  EVENTS_TRIGGERED[16];              /*!< Description collection[0]: Event number 0 generated by triggering
                                                         the corresponding TRIGGER[0] task                                     */
  __I  uint32_t  RESERVED2[16];
  __IO uint32_t  PUBLISH_TRIGGERED[16];             /*!< Description collection[0]: Publish configuration for EVENTS_TRIGGERED[0] */
  __I  uint32_t  RESERVED3[80];
  __IO uint32_t  INTEN;                             /*!< Enable or disable interrupt                                           */
  __IO uint32_t  INTENSET;                          /*!< Enable interrupt                                                      */
  __IO uint32_t  INTENCLR;                          /*!< Disable interrupt                                                     */
} NRF_EGU_Type;


/* ================================================================================ */
/* ================                       PWM                      ================ */
/* ================================================================================ */


/**
  * @brief Pulse Width Modulation Unit (PWM)
  */

