jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.h
typedef struct {                                    /*!< PWM Structure                                                         */
  __O  uint32_t  TASKS_START;                       /*!< Starts PWM pulse generation with the last loaded values               */
  __O  uint32_t  TASKS_STOP;                        /*!< Stops PWM pulse generation on all channels at the end of current
                                                         PWM period, and stops sequence playback                               */
  __O  uint32_t  TASKS_SEQSTART[2];                 /*!< Description collection[0]: Loads the first PWM value on all
                                                         enabled channels from sequence 0, and starts playing that sequence
                                                          at the rate defined in SEQ[0]REFRESH and/or DECODER.MODE. Causes
                                                          PWM generation to start it was not running. Sending a SEQSTART[0]
                                                          task while a sequence is already playing back will gracefully
                                                          (i.e. glitch-free) abort that sequence at the earliest opportunity
                                                          and start sequence 0.                                                */
  __O  uint32_t  TASKS_NEXTSTEP;                    /*!< Steps by one value in the current sequence on all enabled channels
                                                         if DECODER.MODE=NextStep. Does not cause PWM generation to start
                                                          it was not running.                                                  */
  __O  uint32_t  TASKS_SEQABORT;                    /*!< (Gracefully) aborts the playback of the current sequence or
                                                         the current end delay.                                                */
  __I  uint32_t  RESERVED0[26];
  __IO uint32_t  SUBSCRIBE_START;                   /*!< Subscribe configuration for TASKS_START                               */
  __IO uint32_t  SUBSCRIBE_STOP;                    /*!< Subscribe configuration for TASKS_STOP                                */
  __IO uint32_t  SUBSCRIBE_SEQSTART[2];             /*!< Description collection[0]: Subscribe configuration for TASKS_SEQSTART[0] */
  __IO uint32_t  SUBSCRIBE_NEXTSTEP;                /*!< Subscribe configuration for TASKS_NEXTSTEP                            */
  __IO uint32_t  SUBSCRIBE_SEQABORT;                /*!< Subscribe configuration for TASKS_SEQABORT                            */
  __I  uint32_t  RESERVED1[26];
  __IO uint32_t  EVENTS_STARTED;                    /*!< Response to START task, emitted when PWM pulses start to get
                                                         generated                                                             */
  __IO uint32_t  EVENTS_STOPPED;                    /*!< Response to STOP task, emitted when PWM pulses are no longer
                                                         generated                                                             */
  __IO uint32_t  EVENTS_SEQSTARTED[2];              /*!< Description collection[0]: First PWM period started on sequence
                                                         0                                                                     */
  __IO uint32_t  EVENTS_SEQEND[2];                  /*!< Description collection[0]: Emitted at end of every sequence
                                                         0, when last value from RAM has been applied to wave counter          */
  __IO uint32_t  EVENTS_PWMPERIODEND;               /*!< Emitted at the end of each PWM period                                 */
  __IO uint32_t  EVENTS_LOOPSDONE;                  /*!< Concatenated sequences have been played the amount of times
                                                         defined in LOOP.CNT                                                   */
  __IO uint32_t  EVENTS_RAMUNDERFLOW;               /*!< Emitted when a RAM fecth does not complete in time for the PWM
                                                         module                                                                */
  __IO uint32_t  EVENTS_DMAREADY[2];                /*!< Description collection[0]: Emitted when EasyDMA has fetched
                                                         .PTR and .CNT registers for sequence 0 (they can be prepared
                                                          for the next sequence)                                               */
  __IO uint32_t  EVENTS_DMAEND[2];                  /*!< Description collection[0]: Emitted when EasyDMA has finished
                                                         fetching values of sequence 0 from RAM buffer                         */
  __I  uint32_t  RESERVED2[19];
  __IO uint32_t  PUBLISH_STARTED;                   /*!< Publish configuration for EVENTS_STARTED                              */
  __IO uint32_t  PUBLISH_STOPPED;                   /*!< Publish configuration for EVENTS_STOPPED                              */
  __IO uint32_t  PUBLISH_SEQSTARTED[2];             /*!< Description collection[0]: Publish configuration for EVENTS_SEQSTARTED[0] */
  __IO uint32_t  PUBLISH_SEQEND[2];                 /*!< Description collection[0]: Publish configuration for EVENTS_SEQEND[0] */
  __IO uint32_t  PUBLISH_PWMPERIODEND;              /*!< Publish configuration for EVENTS_PWMPERIODEND                         */
  __IO uint32_t  PUBLISH_LOOPSDONE;                 /*!< Publish configuration for EVENTS_LOOPSDONE                            */
  __IO uint32_t  PUBLISH_RAMUNDERFLOW;              /*!< Publish configuration for EVENTS_RAMUNDERFLOW                         */
  __IO uint32_t  PUBLISH_DMAREADY[2];               /*!< Description collection[0]: Publish configuration for EVENTS_DMAREADY[0] */
  __IO uint32_t  PUBLISH_DMAEND[2];                 /*!< Description collection[0]: Publish configuration for EVENTS_DMAEND[0] */
  __I  uint32_t  RESERVED3[19];
  __IO uint32_t  SHORTS;                            /*!< Shortcut register                                                     */
  __I  uint32_t  RESERVED4[63];
  __IO uint32_t  INTEN;                             /*!< Enable or disable interrupt                                           */
  __IO uint32_t  INTENSET;                          /*!< Enable interrupt                                                      */
  __IO uint32_t  INTENCLR;                          /*!< Disable interrupt                                                     */
  __I  uint32_t  RESERVED5[125];
  __IO uint32_t  ENABLE;                            /*!< PWM module enable register                                            */
  __IO uint32_t  MODE;                              /*!< Selects operating mode of the wave counter                            */
  __IO uint32_t  COUNTERTOP;                        /*!< Value up to which the pulse generator counter counts                  */
  __IO uint32_t  PRESCALER;                         /*!< Configuration for PWM_CLK                                             */
  __IO uint32_t  DECODER;                           /*!< Configuration of the decoder                                          */
  __IO uint32_t  LOOP;                              /*!< Amount of playback of a loop                                          */
  __I  uint32_t  RESERVED6[2];
  PWM_SEQ_Type SEQ[2];                              /*!< Unspecified                                                           */
  PWM_PSEL_Type PSEL;                               /*!< Unspecified                                                           */
} NRF_PWM_Type;


/* ================================================================================ */
/* ================                       PDM                      ================ */
/* ================================================================================ */


/**
  * @brief Pulse Density Modulation (Digital Microphone) Interface (PDM)
  */

typedef struct {                                    /*!< PDM Structure                                                         */
  __O  uint32_t  TASKS_START;                       /*!< Starts continuous PDM transfer                                        */
  __O  uint32_t  TASKS_STOP;                        /*!< Stops PDM transfer                                                    */
  __I  uint32_t  RESERVED0[30];
  __IO uint32_t  SUBSCRIBE_START;                   /*!< Subscribe configuration for TASKS_START                               */
  __IO uint32_t  SUBSCRIBE_STOP;                    /*!< Subscribe configuration for TASKS_STOP                                */
  __I  uint32_t  RESERVED1[30];
  __IO uint32_t  EVENTS_STARTED;                    /*!< PDM transfer has started                                              */
  __IO uint32_t  EVENTS_STOPPED;                    /*!< PDM transfer has finished                                             */
  __IO uint32_t  EVENTS_END;                        /*!< The PDM has written the last sample specified by SAMPLE.MAXCNT
                                                         (or the last sample after a STOP task has been received) to
                                                          Data RAM                                                             */
  __IO uint32_t  EVENTS_OVERRUN;                    /*!< PDM samples lost due to DMA destination not available                 */
  __I  uint32_t  RESERVED2[28];
  __IO uint32_t  PUBLISH_STARTED;                   /*!< Publish configuration for EVENTS_STARTED                              */
  __IO uint32_t  PUBLISH_STOPPED;                   /*!< Publish configuration for EVENTS_STOPPED                              */
  __IO uint32_t  PUBLISH_END;                       /*!< Publish configuration for EVENTS_END                                  */
  __IO uint32_t  PUBLISH_OVERRUN;                   /*!< Publish configuration for EVENTS_OVERRUN                              */
  __I  uint32_t  RESERVED3[92];
  __IO uint32_t  INTEN;                             /*!< Enable or disable interrupt                                           */
  __IO uint32_t  INTENSET;                          /*!< Enable interrupt                                                      */
  __IO uint32_t  INTENCLR;                          /*!< Disable interrupt                                                     */
  __I  uint32_t  RESERVED4[125];
  __IO uint32_t  ENABLE;                            /*!< PDM module enable register                                            */
  __IO uint32_t  PDMCLKCTRL;                        /*!< PDM clock generator control                                           */
  __IO uint32_t  MODE;                              /*!< Defines the routing of the connected PDM microphones' signals         */
  __IO uint32_t  FDBYPASS;                          /*!< Bypass the frequency doubler in the PDM clock generation              */
  __I  uint32_t  RXDLDATA;                          /*!< Left sample from filter output                                        */
  __I  uint32_t  RXDRDATA;                          /*!< Right sample from filter output                                       */
  __IO uint32_t  GAINL;                             /*!< Left output gain adjustment                                           */
  __IO uint32_t  GAINR;                             /*!< Right output gain adjustment                                          */
  __I  uint32_t  RESERVED5[2];
  PDM_FILTER_Type FILTER;                           /*!< Unspecified                                                           */
  __IO uint32_t  PHASE;                             /*!< Selection of delay on the clock line (to avoid potential setup&amp;hold
                                                         timing violation on input data)                                       */
  PDM_PSEL_Type PSEL;                               /*!< Unspecified                                                           */
  __IO uint32_t  TSEL;                              /*!< Trim value for ramTSEL[1:0] on the RamBist interface                  */
  __I  uint32_t  RESERVED6[5];
  PDM_SAMPLE_Type SAMPLE;                           /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED7[676];
  __IO uint32_t  POWER;                             /*!< Peripheral power control                                              */
} NRF_PDM_Type;


/* ================================================================================ */
/* ================                       I2S                      ================ */
/* ================================================================================ */


/**
  * @brief Inter-IC Sound (I2S)
  */

typedef struct {                                    /*!< I2S Structure                                                         */
  __O  uint32_t  TASKS_START;                       /*!< Starts continuous I2S transfer. Also starts MCK generator when
                                                         this is enabled.                                                      */
  __O  uint32_t  TASKS_STOP;                        /*!< Stops I2S transfer. Also stops MCK generator. Triggering this
                                                         task will cause the {event:STOPPED} event to be generated.            */
  __I  uint32_t  RESERVED0[10];
  __O  uint32_t  TASKS_DMA_START_TX;                /*!< Equivalent to ID_DMA_CHANNEL_PERIPHERAL_TASK_TRIG_START_TX.           */
  __O  uint32_t  TASKS_DMA_START_RX;                /*!< Equivalent to ID_DMA_CHANNEL_PERIPHERAL_TASK_TRIG_START_RX.           */
  __O  uint32_t  TASKS_DMA_STOP_TX;                 /*!< Equivalent to ID_DMA_CHANNEL_PERIPHERAL_TASK_TRIG_STOP_TX.            */
  __O  uint32_t  TASKS_DMA_STOP_RX;                 /*!< Equivalent to ID_DMA_CHANNEL_PERIPHERAL_TASK_TRIG_STOP_RX.            */
  __I  uint32_t  RESERVED1[16];
  __IO uint32_t  SUBSCRIBE_START;                   /*!< Subscribe configuration for TASKS_START                               */
  __IO uint32_t  SUBSCRIBE_STOP;                    /*!< Subscribe configuration for TASKS_STOP                                */
  __I  uint32_t  RESERVED2[10];
  __IO uint32_t  SUBSCRIBE_DMA_START_TX;            /*!< Subscribe configuration for TASKS_DMA_START_TX                        */
  __IO uint32_t  SUBSCRIBE_DMA_START_RX;            /*!< Subscribe configuration for TASKS_DMA_START_RX                        */
  __IO uint32_t  SUBSCRIBE_DMA_STOP_TX;             /*!< Subscribe configuration for TASKS_DMA_STOP_TX                         */
  __IO uint32_t  SUBSCRIBE_DMA_STOP_RX;             /*!< Subscribe configuration for TASKS_DMA_STOP_RX                         */
  __I  uint32_t  RESERVED3[16];
  __IO uint32_t  EVENTS_DMA_END_TX;                 /*!< Equivalent to eventDmaEndTx                                           */
  __IO uint32_t  EVENTS_RXPTRUPD;                   /*!< The RXD.PTR register has been copied to internal double-buffers.
                                                         When the I2S module is started and RX is enabled, this event
                                                          will be generated for every RXTXD.MAXCNT words that are received
                                                          on the SDIN pin. Equivalent to eventDmaReadyRx.                      */
  __IO uint32_t  EVENTS_STOPPED;                    /*!< I2S transfer stopped. There are no requirements to how "graceful"
                                                         the I2S module shall be stopped. The reason for this is that
                                                          we are talking about streaming audio data here, and thus loosing
                                                          some data is not critical. Graceful stopping of stream can easily
                                                          be done in FW. Equivalent to eventStopped                            */
  __IO uint32_t  EVENTS_ERROR_TX;                   /*!< DMA read from memory failed. Equivalent to eventUnderflowTx           */
  __IO uint32_t  EVENTS_ERROR_RX;                   /*!< DMA write to memory failed. Equivalent to eventOverflowRx             */
  __IO uint32_t  EVENTS_TXPTRUPD;                   /*!< The TDX.PTR register has been copied to internal double-buffers.
                                                         When the I2S module is started and TX is enabled, this event
                                                          will be generated for every RXTXD.MAXCNT words that are sent
                                                          on the SDOUT pin. Equivalent to eventDmaReadyTx.                     */
  __IO uint32_t  EVENTS_DMA_END_RX;                 /*!< DMA write to memory failed. Equivalent to eventDmaEndRx               */
  __I  uint32_t  RESERVED4[25];
  __IO uint32_t  PUBLISH_DMA_END_TX;                /*!< Publish configuration for EVENTS_DMA_END_TX                           */
  __IO uint32_t  PUBLISH_RXPTRUPD;                  /*!< Publish configuration for EVENTS_RXPTRUPD                             */
  __IO uint32_t  PUBLISH_STOPPED;                   /*!< Publish configuration for EVENTS_STOPPED                              */
  __IO uint32_t  PUBLISH_ERROR_TX;                  /*!< Publish configuration for EVENTS_ERROR_TX                             */
  __IO uint32_t  PUBLISH_ERROR_RX;                  /*!< Publish configuration for EVENTS_ERROR_RX                             */
  __IO uint32_t  PUBLISH_TXPTRUPD;                  /*!< Publish configuration for EVENTS_TXPTRUPD                             */
  __IO uint32_t  PUBLISH_DMA_END_RX;                /*!< Publish configuration for EVENTS_DMA_END_RX                           */
  __I  uint32_t  RESERVED5[89];
  __IO uint32_t  INTEN;                             /*!< Enable or disable interrupt                                           */
  __IO uint32_t  INTENSET;                          /*!< Enable interrupt                                                      */
  __IO uint32_t  INTENCLR;                          /*!< Disable interrupt                                                     */
  __I  uint32_t  RESERVED6[125];
  __IO uint32_t  ENABLE;                            /*!< Enable I2S module.                                                    */
  I2S_CONFIG_Type CONFIG;                           /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED7[3];
  I2S_RXD_Type RXD;                                 /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED8;
  I2S_TXD_Type TXD;                                 /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED9[3];
  I2S_RXTXD_Type RXTXD;                             /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED10[2];
  I2S_PSEL_Type PSEL;                               /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED11[99];
  __IO uint32_t  DMA_ENABLE_RX;                     /*!< Equivalent to ID_DMA_CHANNEL_PERIPHERAL_ENABLE_RX.                    */
  __IO uint32_t  DMA_ENABLE_TX;                     /*!< Equivalent to ID_DMA_CHANNEL_PERIPHERAL_ENABLE_TX.                    */
} NRF_I2S_Type;


/* ================================================================================ */
/* ================                       IPC                      ================ */
/* ================================================================================ */


/**
  * @brief Inter Processor Communication (IPC)
  */

typedef struct {                                    /*!< IPC Structure                                                         */
  __O  uint32_t  TASKS_SEND[8];                     /*!< Description collection[0]: Trigger events on channel enabled
                                                         in SEND_CNF[0].                                                       */
  __I  uint32_t  RESERVED0[24];
  __IO uint32_t  SUBSCRIBE_SEND[8];                 /*!< Description collection[0]: Subscribe configuration for TASKS_SEND[0]  */
  __I  uint32_t  RESERVED1[24];
  __IO uint32_t  EVENTS_RECEIVE[8];                 /*!< Description collection[0]: Event received on one or more of
                                                         the enabled channels in RECEIVE_CNF[{n}].                             */
  __I  uint32_t  RESERVED2[24];
  __IO uint32_t  PUBLISH_RECEIVE[8];                /*!< Description collection[0]: Publish configuration for EVENTS_RECEIVE[0] */
  __I  uint32_t  RESERVED3[88];
  __IO uint32_t  INTEN;                             /*!< Enable or disable interrupt                                           */
  __IO uint32_t  INTENSET;                          /*!< Enable interrupt                                                      */
  __IO uint32_t  INTENCLR;                          /*!< Disable interrupt                                                     */
  __I  uint32_t  INTPEND;                           /*!< Pending status of interrupt                                           */
  __I  uint32_t  RESERVED4[128];
  __IO uint32_t  SEND_CNF[8];                       /*!< Description collection[0]: Send event configuration for TASKS_SEND[0]. */
  __I  uint32_t  RESERVED5[24];
  __IO uint32_t  RECEIVE_CNF[8];                    /*!< Description collection[0]: Receive event configuration for EVENTS_RECEIVE[
                                                         0].                                                                   */
  __I  uint32_t  RESERVED6[24];
  __IO uint32_t  GPMEM[2];                          /*!< Description collection[0]: General purpose memory.                    */
} NRF_IPC_Type;


/* ================================================================================ */
/* ================                      QSPI                      ================ */
/* ================================================================================ */


/**
  * @brief External Flash interface (QSPI)
  */

