jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.h
typedef struct {                                    /*!< QSPI Structure                                                        */
  __O  uint32_t  TASKS_ACTIVATE;                    /*!< Activate QSPI interface.                                              */
  __O  uint32_t  TASKS_READSTART;                   /*!< Start transfer from external Flash memory to internal RAM.            */
  __O  uint32_t  TASKS_WRITESTART;                  /*!< Start transfer from internal RAM to external Flash memory.            */
  __O  uint32_t  TASKS_ERASESTART;                  /*!< Start external Flash memory erase operation.                          */
  __O  uint32_t  TASKS_DEACTIVATE;                  /*!< Deactivate QSPI interface.                                            */
  __I  uint32_t  RESERVED0[27];
  __IO uint32_t  SUBSCRIBE_ACTIVATE;                /*!< Subscribe configuration for TASKS_ACTIVATE                            */
  __IO uint32_t  SUBSCRIBE_READSTART;               /*!< Subscribe configuration for TASKS_READSTART                           */
  __IO uint32_t  SUBSCRIBE_WRITESTART;              /*!< Subscribe configuration for TASKS_WRITESTART                          */
  __IO uint32_t  SUBSCRIBE_ERASESTART;              /*!< Subscribe configuration for TASKS_ERASESTART                          */
  __IO uint32_t  SUBSCRIBE_DEACTIVATE;              /*!< Subscribe configuration for TASKS_DEACTIVATE                          */
  __I  uint32_t  RESERVED1[27];
  __IO uint32_t  EVENTS_READY;                      /*!< QSPI peripheral is ready. This event will be generated as a
                                                         response to any QSPI task.                                            */
  __I  uint32_t  RESERVED2[31];
  __IO uint32_t  PUBLISH_READY;                     /*!< Publish configuration for EVENTS_READY                                */
  __I  uint32_t  RESERVED3[95];
  __IO uint32_t  INTEN;                             /*!< Enable or disable interrupt                                           */
  __IO uint32_t  INTENSET;                          /*!< Enable interrupt                                                      */
  __IO uint32_t  INTENCLR;                          /*!< Disable interrupt                                                     */
  __I  uint32_t  RESERVED4[125];
  __IO uint32_t  ENABLE;                            /*!< Enable QSPI peripheral and acquire pins selected in PSELn registers.  */
  QSPI_READ_Type READ;                              /*!< Unspecified                                                           */
  QSPI_WRITE_Type WRITE;                            /*!< Unspecified                                                           */
  QSPI_ERASE_Type ERASE;                            /*!< Unspecified                                                           */
  QSPI_PSEL_Type PSEL;                              /*!< Unspecified                                                           */
  __IO uint32_t  XIPOFFSET;                         /*!< Address offset into the external memory for Execute in Place
                                                         operation.                                                            */
  __IO uint32_t  IFCONFIG0;                         /*!< Interface configuration. SPI MEM CTRL Default Memory reg.             */
  __I  uint32_t  RESERVED5[46];
  __IO uint32_t  IFCONFIG1;                         /*!< Interface configuration. SPI MEM CTRL Control reg.                    */
  __I  uint32_t  STATUS;                            /*!< Status register. SPI MEM CTRL Status reg.                             */
  __IO uint32_t  ACCESSREQ0;                        /*!< Access request, word 0. SPI MEM CTRL Access Request reg. 0.           */
  __IO uint32_t  ACCESSREQ1;                        /*!< Access request, word 1. SPI MEM CTRL Access Request reg. 1.           */
  __IO uint32_t  ACCESSREQ2;                        /*!< Access request, word 2. SPI MEM CTRL Access Request reg. 2.           */
  __IO uint32_t  DPMDUR;                            /*!< Set the duration required to enter/exit Deep Power-down Mode
                                                         (DPM). SPI MEM CTRL Duration DPM reg.                                 */
  __IO uint32_t  DATARW;                            /*!< Read data when read, write data when written. SPI MEM CTRL Read/Write
                                                         Data reg.                                                             */
  __I  uint32_t  FIFOSTAT;                          /*!< The number of items in Read and Write FIFOs. SPI MEM CTRL FIFOs
                                                         Status reg.                                                           */
  __IO uint32_t  DEFMEM;                            /*!< Default memory register. SPI MEM Default memory register. Fields
                                                         adn content equivalent to IFCONFIG0.                                  */
  __IO uint32_t  ADDRCONFIG;                        /*!< Extended address configuration. SPI MEM CTRL Extended Addressing
                                                         Mode reg.                                                             */
  __IO uint32_t  MEMSPEC;                           /*!< Byte specification: 1 byte manufacture ID, 1 byte memory type,
                                                         1 byte density. SPI MEM CTRL Memory Specification reg.                */
  __IO uint32_t  IRQMSK;                            /*!< Interrupts enable disable mask. SPI MEM CTRL Interrupt Mask
                                                         reg.                                                                  */
  __IO uint32_t  IRQREQ;                            /*!< Interrupt request register (reason for triggering interrupt
                                                         signal). SPI MEM CTRL Interrupt Request reg.                          */
  __IO uint32_t  CINSTRCONF;                        /*!< Custom instruction configuration register. SPI MEM CTRL Custom
                                                         Instruction Setup reg.                                                */
  __IO uint32_t  CINSTRDAT0;                        /*!< Custom instruction data register 0. SPI MEM CTRL Custom Instruction
                                                         Data reg. 0.                                                          */
  __IO uint32_t  CINSTRDAT1;                        /*!< Custom instruction data register 1. SPI MEM CTRL Custom Instruction
                                                         Data reg. 1.                                                          */
  __IO uint32_t  READCYCLES;                        /*!< Number of dummy cycles for Read Instructions. SPI MEM CTRL Read
                                                         Dummy Cycles reg.                                                     */
} NRF_QSPI_Type;


/* ================================================================================ */
/* ================                      USBD                      ================ */
/* ================================================================================ */


/**
  * @brief Universal Serial Bus device (USBD)
  */

typedef struct {                                    /*!< USBD Structure                                                        */
  __O  uint32_t  TASKS_USBDREINIT;                  /*!< Resets the whole USBD peripheral. This includes disabling the
                                                         pull-up on D+.                                                        */
  __O  uint32_t  TASKS_STARTEPIN[8];                /*!< Description collection[0]: Captures the EPIN[0].PTR, EPIN[0].MAXCNT
                                                         and EPIN[0].CONFIG registers values, and enables endpoint IN
                                                          0 to respond to traffic from host                                    */
  __O  uint32_t  TASKS_STARTISOIN;                  /*!< Description collection[0]: Captures the ISOIN[0].PTR, ISOIN[0].MAXCNT
                                                         and ISOIN[0].CONFIG registers values, and enables sending data
                                                          on iso endpoint                                                      */
  __O  uint32_t  TASKS_STARTEPOUT[8];               /*!< Description collection[0]: Captures the EPOUT[0].PTR, EPOUT[0].MAXCNT
                                                         and EPOUT[0].CONFIG registers values, and enables endpoint 0
                                                          to respond to traffic from host                                      */
  __O  uint32_t  TASKS_STARTISOOUT;                 /*!< Description collection[0]: Captures the ISOOUT[0].PTR, ISOOUT[0].MAXCNT
                                                         and ISOOUT[0].CONFIG registers values, and enables receiving
                                                          of data on iso endpoint                                              */
  __O  uint32_t  TASKS_EP0RCVOUT;                   /*!< Allows OUT data stage on control endpoint 0                           */
  __O  uint32_t  TASKS_EP0STATUS;                   /*!< Allows status stage on control endpoint 0                             */
  __O  uint32_t  TASKS_EP0STALL;                    /*!< STALLs data and status stage on control endpoint 0                    */
  __O  uint32_t  TASKS_DPDMDRIVE;                   /*!< Forces D+ and D-lines to the state defined in the DPDMVALUE
                                                         register                                                              */
  __O  uint32_t  TASKS_DPDMNODRIVE;                 /*!< Stops forcing D+ and D- lines to any state (USB engine takes
                                                         control)                                                              */
  __I  uint32_t  RESERVED0[8];
  __IO uint32_t  SUBSCRIBE_USBDREINIT;              /*!< Subscribe configuration for TASKS_USBDREINIT                          */
  __IO uint32_t  SUBSCRIBE_STARTEPIN[8];            /*!< Description collection[0]: Subscribe configuration for TASKS_STARTEPIN[0] */
  __IO uint32_t  SUBSCRIBE_STARTISOIN;              /*!< Description collection[0]: Subscribe configuration for TASKS_STARTISOIN[0] */
  __IO uint32_t  SUBSCRIBE_STARTEPOUT[8];           /*!< Description collection[0]: Subscribe configuration for TASKS_STARTEPOUT[0] */
  __IO uint32_t  SUBSCRIBE_STARTISOOUT;             /*!< Description collection[0]: Subscribe configuration for TASKS_STARTISOOUT[0
                                                         ]                                                                     */
  __IO uint32_t  SUBSCRIBE_EP0RCVOUT;               /*!< Subscribe configuration for TASKS_EP0RCVOUT                           */
  __IO uint32_t  SUBSCRIBE_EP0STATUS;               /*!< Subscribe configuration for TASKS_EP0STATUS                           */
  __IO uint32_t  SUBSCRIBE_EP0STALL;                /*!< Subscribe configuration for TASKS_EP0STALL                            */
  __IO uint32_t  SUBSCRIBE_DPDMDRIVE;               /*!< Subscribe configuration for TASKS_DPDMDRIVE                           */
  __IO uint32_t  SUBSCRIBE_DPDMNODRIVE;             /*!< Subscribe configuration for TASKS_DPDMNODRIVE                         */
  __I  uint32_t  RESERVED1[8];
  __IO uint32_t  EVENTS_USBRESET;                   /*!< Signals that a USB reset condition has been detected on the
                                                         USB lines                                                             */
  __IO uint32_t  EVENTS_STARTED;                    /*!< Confirms that the EPIN[n].PTR, EPIN[n].MAXCNT, EPIN[n].CONFIG,
                                                         or EPOUT[n].PTR, EPOUT[n].MAXCNT and EPOUT[n].CONFIG registers
                                                          have been captured on all endpoints reported in the EPSTATUS
                                                          register                                                             */
  __IO uint32_t  EVENTS_ENDEPIN[8];                 /*!< Description collection[0]: The whole EPIN[0] buffer has been
                                                         consumed. The RAM buffer can be accessed safely by software.          */
  __IO uint32_t  EVENTS_EP0DATADONE;                /*!< An acknowledged data transfer has taken place on the control
                                                         endpoint                                                              */
  __IO uint32_t  EVENTS_ENDISOIN;                   /*!< Description collection[0]: The whole ISOIN[0] buffer has been
                                                         consumed. The RAM buffer can be accessed safely by software.          */
  __IO uint32_t  EVENTS_ENDEPOUT[8];                /*!< Description collection[0]: The whole EPOUT[0] buffer has been
                                                         consumed. The RAM buffer can be accessed safely by software.          */
  __IO uint32_t  EVENTS_ENDISOOUT;                  /*!< Description collection[0]: The whole ISOOUT[0] buffer has been
                                                         consumed. The RAM buffer can be accessed safely by software.          */
  __IO uint32_t  EVENTS_SOF;                        /*!< Signals that a SOF (start of frame) condition has been detected
                                                         on the USB lines                                                      */
  __IO uint32_t  EVENTS_USBEVENT;                   /*!< An event or an error not covered by specific events has occurred,
                                                         check EVENTCAUSE register to find the cause                           */
  __IO uint32_t  EVENTS_EP0SETUP;                   /*!< A valid SETUP token has been received (and acknowledged) on
                                                         the control endpoint                                                  */
  __IO uint32_t  EVENTS_EPDATA;                     /*!< A data transfer has occurred on a data endpoint, indicated by
                                                         the EPDATASTATUS register                                             */
  __IO uint32_t  EVENTS_ACCESSFAULT;                /*!< Access to an unavailable USB register has been attempted (software
                                                         or EasyDMA). This event can get fired even when USBD is not
                                                          ENABLEd.                                                             */
  __I  uint32_t  RESERVED2[6];
  __IO uint32_t  PUBLISH_USBRESET;                  /*!< Publish configuration for EVENTS_USBRESET                             */
  __IO uint32_t  PUBLISH_STARTED;                   /*!< Publish configuration for EVENTS_STARTED                              */
  __IO uint32_t  PUBLISH_ENDEPIN[8];                /*!< Description collection[0]: Publish configuration for EVENTS_ENDEPIN[0] */
  __IO uint32_t  PUBLISH_EP0DATADONE;               /*!< Publish configuration for EVENTS_EP0DATADONE                          */
  __IO uint32_t  PUBLISH_ENDISOIN;                  /*!< Description collection[0]: Publish configuration for EVENTS_ENDISOIN[0] */
  __IO uint32_t  PUBLISH_ENDEPOUT[8];               /*!< Description collection[0]: Publish configuration for EVENTS_ENDEPOUT[0] */
  __IO uint32_t  PUBLISH_ENDISOOUT;                 /*!< Description collection[0]: Publish configuration for EVENTS_ENDISOOUT[0] */
  __IO uint32_t  PUBLISH_SOF;                       /*!< Publish configuration for EVENTS_SOF                                  */
  __IO uint32_t  PUBLISH_USBEVENT;                  /*!< Publish configuration for EVENTS_USBEVENT                             */
  __IO uint32_t  PUBLISH_EP0SETUP;                  /*!< Publish configuration for EVENTS_EP0SETUP                             */
  __IO uint32_t  PUBLISH_EPDATA;                    /*!< Publish configuration for EVENTS_EPDATA                               */
  __IO uint32_t  PUBLISH_ACCESSFAULT;               /*!< Publish configuration for EVENTS_ACCESSFAULT                          */
  __I  uint32_t  RESERVED3[6];
  __IO uint32_t  SHORTS;                            /*!< Shortcut register                                                     */
  __I  uint32_t  RESERVED4[63];
  __IO uint32_t  INTEN;                             /*!< Enable or disable interrupt                                           */
  __IO uint32_t  INTENSET;                          /*!< Enable interrupt                                                      */
  __IO uint32_t  INTENCLR;                          /*!< Disable interrupt                                                     */
  __I  uint32_t  RESERVED5[61];
  __IO uint32_t  EVENTCAUSE;                        /*!< Details on event that caused the USBEVENT event                       */
  __I  uint32_t  BUSSTATE;                          /*!< Provides the logic state of the D+ and D- lines                       */
  __I  uint32_t  RESERVED6[6];
  USBD_HALTED_Type HALTED;                          /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED7;
  __IO uint32_t  EPSTATUS;                          /*!< Provides information on which endpoint's EasyDMA registers have
                                                         been captured                                                         */
  __IO uint32_t  EPDATASTATUS;                      /*!< Provides information on which endpoint(s) an acknowledged data
                                                         transfer has occurred (EPDATA event)                                  */
  __I  uint32_t  USBADDR;                           /*!< Device USB address                                                    */
  __I  uint32_t  DMASTATE;                          /*!< Indicates activity state of the DMA                                   */
  __I  uint32_t  RESERVED8[2];
  __I  uint32_t  BMREQUESTTYPE;                     /*!< SETUP data, byte 0, bmRequestType                                     */
  __I  uint32_t  BREQUEST;                          /*!< SETUP data, byte 1, bRequest                                          */
  __I  uint32_t  WVALUEL;                           /*!< SETUP data, byte 2, LSB of wValue                                     */
  __I  uint32_t  WVALUEH;                           /*!< SETUP data, byte 3, MSB of wValue                                     */
  __I  uint32_t  WINDEXL;                           /*!< SETUP data, byte 4, LSB of wIndex                                     */
  __I  uint32_t  WINDEXH;                           /*!< SETUP data, byte 5, MSB of wIndex                                     */
  __I  uint32_t  WLENGTHL;                          /*!< SETUP data, byte 6, LSB of wLength                                    */
  __I  uint32_t  WLENGTHH;                          /*!< SETUP data, byte 7, MSB of wLength                                    */
  USBD_SIZE_Type SIZE;                              /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED9[15];
  __IO uint32_t  ENABLE;                            /*!< Enable USB                                                            */
  __IO uint32_t  USBPULLUP;                         /*!< Control of the USB pull-up                                            */
  __IO uint32_t  DPDMVALUE;                         /*!< State at which the DPDMDRIVE task will force D+ and D-. The
                                                         DPDMNODRIVE task reverts the control of the lines to MAC IP
                                                          (no forcing).                                                        */
  __IO uint32_t  DTOGGLE;                           /*!< Data toggle control and status.                                       */
  __IO uint32_t  EPINEN;                            /*!< Endpoint IN enable                                                    */
  __IO uint32_t  EPOUTEN;                           /*!< Endpoint OUT enable                                                   */
  __O  uint32_t  EPSTALL;                           /*!< STALL endpoints                                                       */
  __IO uint32_t  ISOSPLIT;                          /*!< Controls the split of ISO buffers                                     */
  __I  uint32_t  FRAMECNTR;                         /*!< Returns the current value of the start of frame counter               */
  __IO uint32_t  TESTUSBPULLUP;                     /*!< Control of the USB pull-up value, for test purposes                   */
  __IO uint32_t  TSEL;                              /*!< Trim value for ramTSEL[1:0] on the RamBist interface                  */
  __IO uint32_t  LOWPOWER;                          /*!< First silicon only: Controls USBD peripheral low-power mode
                                                         during USB suspend                                                    */
  __IO uint32_t  ISOINCONFIG;                       /*!< Controls the response of the ISO IN endpoint to an IN token
                                                         when no data is ready to be sent                                      */
  __I  uint32_t  RESERVED10[51];
  USBD_EPIN_Type EPIN[8];                           /*!< Unspecified                                                           */
  USBD_ISOIN_Type ISOIN;                            /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED11[20];
  USBD_EPOUT_Type EPOUT[8];                         /*!< Unspecified                                                           */
  USBD_ISOOUT_Type ISOOUT;                          /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED12[20];
  __IO uint32_t  RAWADDR;                           /*!< Address to be used for accessing the MAC IP4000                       */
  __IO uint32_t  RAWDATA;                           /*!< Actual read or write access to the raw IP, using RAWADDR address      */
  __I  uint32_t  RESERVED13[508];
  __IO uint32_t  REGRESET;                          /*!< Registers reset. Writing any value to this register will reset
                                                         all registers in this peripheral to their reset values. Read
                                                          access to this register has no consequence. Not implemented
                                                          in first silicon.                                                    */
  __IO uint32_t  POWER;                             /*!< Peripheral power control                                              */
} NRF_USBD_Type;


/* ================================================================================ */
/* ================                      NVMC                      ================ */
/* ================================================================================ */


/**
  * @brief Non Volatile Memory Controller (NVMC)
  */

