jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.h
typedef struct {                                    /*!< NVMC Structure                                                        */
  __I  uint32_t  RESERVED0[256];
  __I  uint32_t  READY;                             /*!< Ready flag                                                            */
  __I  uint32_t  VERIFYFAILED;                      /*!< Flag to signal that a flash erase or write operation has failed       */
  __I  uint32_t  RESERVED1[63];
  __IO uint32_t  CONFIG;                            /*!< Configuration register                                                */

  union {
    __IO uint32_t  ERASEPCR1;                       /*!< Deprecated register - Register for erasing a page in Code area.
                                                         Equivalent to ERASEPAGE.                                              */
    __IO uint32_t  ERASEPAGE;                       /*!< Register for erasing a page in Code area                              */
  };
  __IO uint32_t  ERASEALL;                          /*!< Register for erasing all non-volatile user memory                     */
  __IO uint32_t  ERASEPCR0;                         /*!< Deprecated register - Register for erasing a page in Code area.
                                                         Equivalent to ERASEPAGE.                                              */
  __IO uint32_t  ERASEUICR;                         /*!< Register for erasing User Information Configuration Registers         */
  __IO uint32_t  ERASEPAGEPARTIAL;                  /*!< Register for partial erase of a page in Code area                     */
  __IO uint32_t  ERASEPAGEPARTIALCFG;               /*!< Register for partial erase configuration                              */
  __I  uint32_t  RESERVED2[4];
  __IO uint32_t  WAITSTATENUM;                      /*!< Register to set the number of waitstate for flash access              */
  __I  uint32_t  RESERVED3[3];
  __IO uint32_t  ICACHECNF;                         /*!< I-Code cache configuration register.                                  */
  __I  uint32_t  RESERVED4;
  __IO uint32_t  IHIT;                              /*!< I-Code cache hit counter.                                             */
  __IO uint32_t  IMISS;                             /*!< I-Code cache miss counter.                                            */
  __I  uint32_t  RESERVED5[44];
  __IO uint32_t  TESTMODE;                          /*!< Register for entering test mode. Refer to the flash IP test
                                                         documentation for more details.                                       */
  __IO uint32_t  LVEN;                              /*!< Low Voltage Read Mode                                                 */
  __IO uint32_t  UNUSED0;                           /*!< Unspecified                                                           */
  __IO uint32_t  UNUSED1;                           /*!< Unspecified                                                           */
  __O  uint32_t  TESTMASSERASE;                     /*!< Self-timed mass-erase operation                                       */
  __O  uint32_t  TESTERASEREFCELL;                  /*!< Self-timed erase reference cell operation                             */
  NVMC_TEST_Type TEST;                              /*!< Unspecified                                                           */
} NRF_NVMC_Type;


/* ================================================================================ */
/* ================                       VMC                      ================ */
/* ================================================================================ */


/**
  * @brief Volatile Memory controller (VMC)
  */

typedef struct {                                    /*!< VMC Structure                                                         */
  __I  uint32_t  RESERVED0[384];
  VMC_RAM_Type RAM[8];                              /*!< Unspecified                                                           */
  __I  uint32_t  RESERVED1[537];
  __IO uint32_t  SRAMTRIM;                          /*!< Backdoor trim values for SRAM                                         */
  __IO uint32_t  RamSSNonRetTSel;                   /*!< Timing control values for TSMC RAMs                                   */
} NRF_VMC_Type;


/* ================================================================================ */
/* ================                      GPIO                      ================ */
/* ================================================================================ */


/**
  * @brief GPIO Port (GPIO)
  */

typedef struct {                                    /*!< GPIO Structure                                                        */
  __I  uint32_t  RESERVED0[321];
  __IO uint32_t  OUT;                               /*!< Write GPIO port                                                       */
  __IO uint32_t  OUTSET;                            /*!< Set individual bits in GPIO port                                      */
  __IO uint32_t  OUTCLR;                            /*!< Clear individual bits in GPIO port                                    */
  __I  uint32_t  IN;                                /*!< Read GPIO port                                                        */
  __IO uint32_t  DIR;                               /*!< Direction of GPIO pins                                                */
  __IO uint32_t  DIRSET;                            /*!< DIR set register                                                      */
  __IO uint32_t  DIRCLR;                            /*!< DIR clear register                                                    */
  __IO uint32_t  LATCH;                             /*!< Latch register indicating what GPIO pins that have met the criteria
                                                         set in the PIN_CNF[n].SENSE registers                                 */
  __IO uint32_t  DETECTMODE;                        /*!< Select between default DETECT signal behaviour and LDETECT mode       */
  __I  uint32_t  RESERVED1[54];
  GPIO_PIN_Type PIN[32];                            /*!< Pin 0 direct access                                                   */
  __IO uint32_t  PIN_CNF[32];                       /*!< Description collection[0]: Configuration of GPIO pins                 */
} NRF_GPIO_Type;


/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif




/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

#define NRF_TAD_BASE                    0xE0080000UL
#define NRF_FICR_BASE                   0x00FF0000UL
#define NRF_UICR_BASE                   0x00FF8000UL
#define NRF_PMU_REGULATORS_BASE         0x40000000UL
#define NRF_PMU_OSCILLATORS_BASE        0x40000000UL
#define NRF_RADIOLTE_BASE               0x40000000UL
#define NRF_AMLI_BASE                   0x40000000UL
#define NRF_DCNF_BASE                   0x40000000UL
#define NRF_MWU_BASE                    0x40001000UL
#define NRF_REGULATORS_BASE             0x40003000UL
#define NRF_OSCILLATORS_BASE            0x40003000UL
#define NRF_CLOCK_BASE                  0x40005000UL
#define NRF_POWER_BASE                  0x40005000UL
#define NRF_PAMLI_BASE                  0x40007000UL
#define NRF_UARTE0_BASE                 0x40008000UL
#define NRF_SPIM0_BASE                  0x40008000UL
#define NRF_SPIS0_BASE                  0x40008000UL
#define NRF_TWIM0_BASE                  0x40008000UL
#define NRF_TWIS0_BASE                  0x40008000UL
#define NRF_UARTE1_BASE                 0x40009000UL
#define NRF_SPIM1_BASE                  0x40009000UL
#define NRF_SPIS1_BASE                  0x40009000UL
#define NRF_TWIM1_BASE                  0x40009000UL
#define NRF_TWIS1_BASE                  0x40009000UL
#define NRF_GPIOTE_BASE                 0x4000A000UL
#define NRF_SAADC_BASE                  0x4000B000UL
#define NRF_TIMER0_BASE                 0x4000C000UL
#define NRF_TIMER1_BASE                 0x4000D000UL
#define NRF_TIMER2_BASE                 0x4000E000UL
#define NRF_RTC0_BASE                   0x4000F000UL
#define NRF_DPPIC_BASE                  0x40010000UL
#define NRF_NFCT_BASE                   0x40011000UL
#define NRF_WDT_BASE                    0x40012000UL
#define NRF_QDEC_BASE                   0x40013000UL
#define NRF_COMP_BASE                   0x40014000UL
#define NRF_LPCOMP_BASE                 0x40014000UL
#define NRF_SWI0_BASE                   0x40015000UL
#define NRF_EGU0_BASE                   0x40015000UL
#define NRF_PWM0_BASE                   0x40016000UL
#define NRF_PDM_BASE                    0x40017000UL
#define NRF_I2S_BASE                    0x40018000UL
#define NRF_IPC_BASE                    0x40019000UL
#define NRF_EXTFLASH_BASE               0x4001A000UL
#define NRF_RTC1_BASE                   0x4001B000UL
#define NRF_USBD_BASE                   0x4001F000UL
#define NRF_NVMC_BASE                   0x40030000UL
#define NRF_VMC_BASE                    0x40031000UL
#define NRF_GPIO_BASE                   0x40800000UL


/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

#define NRF_TAD                         ((NRF_TAD_Type            *) NRF_TAD_BASE)
#define NRF_FICR                        ((NRF_FICR_Type           *) NRF_FICR_BASE)
#define NRF_UICR                        ((NRF_UICR_Type           *) NRF_UICR_BASE)
#define NRF_PMU_REGULATORS              ((NRF_PMU_REGULATORS_Type *) NRF_PMU_REGULATORS_BASE)
#define NRF_PMU_OSCILLATORS             ((NRF_PMU_OSCILLATORS_Type*) NRF_PMU_OSCILLATORS_BASE)
#define NRF_RADIOLTE                    ((NRF_RADIOLTE_Type       *) NRF_RADIOLTE_BASE)
#define NRF_AMLI                        ((NRF_AMLI_Type           *) NRF_AMLI_BASE)
#define NRF_DCNF                        ((NRF_DCNF_Type           *) NRF_DCNF_BASE)
#define NRF_MWU                         ((NRF_MWU_Type            *) NRF_MWU_BASE)
#define NRF_REGULATORS                  ((NRF_REGULATORS_Type     *) NRF_REGULATORS_BASE)
#define NRF_OSCILLATORS                 ((NRF_OSCILLATORS_Type    *) NRF_OSCILLATORS_BASE)
#define NRF_CLOCK                       ((NRF_CLOCK_Type          *) NRF_CLOCK_BASE)
#define NRF_POWER                       ((NRF_POWER_Type          *) NRF_POWER_BASE)
#define NRF_PAMLI                       ((NRF_PAMLI_Type          *) NRF_PAMLI_BASE)
#define NRF_UARTE0                      ((NRF_UARTE_Type          *) NRF_UARTE0_BASE)
#define NRF_SPIM0                       ((NRF_SPIM_Type           *) NRF_SPIM0_BASE)
#define NRF_SPIS0                       ((NRF_SPIS_Type           *) NRF_SPIS0_BASE)
#define NRF_TWIM0                       ((NRF_TWIM_Type           *) NRF_TWIM0_BASE)
#define NRF_TWIS0                       ((NRF_TWIS_Type           *) NRF_TWIS0_BASE)
#define NRF_UARTE1                      ((NRF_UARTE_Type          *) NRF_UARTE1_BASE)
#define NRF_SPIM1                       ((NRF_SPIM_Type           *) NRF_SPIM1_BASE)
#define NRF_SPIS1                       ((NRF_SPIS_Type           *) NRF_SPIS1_BASE)
#define NRF_TWIM1                       ((NRF_TWIM_Type           *) NRF_TWIM1_BASE)
#define NRF_TWIS1                       ((NRF_TWIS_Type           *) NRF_TWIS1_BASE)
#define NRF_GPIOTE                      ((NRF_GPIOTE_Type         *) NRF_GPIOTE_BASE)
#define NRF_SAADC                       ((NRF_SAADC_Type          *) NRF_SAADC_BASE)
#define NRF_TIMER0                      ((NRF_TIMER_Type          *) NRF_TIMER0_BASE)
#define NRF_TIMER1                      ((NRF_TIMER_Type          *) NRF_TIMER1_BASE)
#define NRF_TIMER2                      ((NRF_TIMER_Type          *) NRF_TIMER2_BASE)
#define NRF_RTC0                        ((NRF_RTC_Type            *) NRF_RTC0_BASE)
#define NRF_DPPIC                       ((NRF_DPPIC_Type          *) NRF_DPPIC_BASE)
#define NRF_NFCT                        ((NRF_NFCT_Type           *) NRF_NFCT_BASE)
#define NRF_WDT                         ((NRF_WDT_Type            *) NRF_WDT_BASE)
#define NRF_QDEC                        ((NRF_QDEC_Type           *) NRF_QDEC_BASE)
#define NRF_COMP                        ((NRF_COMP_Type           *) NRF_COMP_BASE)
#define NRF_LPCOMP                      ((NRF_LPCOMP_Type         *) NRF_LPCOMP_BASE)
#define NRF_SWI0                        ((NRF_SWI_Type            *) NRF_SWI0_BASE)
#define NRF_EGU0                        ((NRF_EGU_Type            *) NRF_EGU0_BASE)
#define NRF_PWM0                        ((NRF_PWM_Type            *) NRF_PWM0_BASE)
#define NRF_PDM                         ((NRF_PDM_Type            *) NRF_PDM_BASE)
#define NRF_I2S                         ((NRF_I2S_Type            *) NRF_I2S_BASE)
#define NRF_IPC                         ((NRF_IPC_Type            *) NRF_IPC_BASE)
#define NRF_EXTFLASH                    ((NRF_QSPI_Type           *) NRF_EXTFLASH_BASE)
#define NRF_RTC1                        ((NRF_RTC_Type            *) NRF_RTC1_BASE)
#define NRF_USBD                        ((NRF_USBD_Type           *) NRF_USBD_BASE)
#define NRF_NVMC                        ((NRF_NVMC_Type           *) NRF_NVMC_BASE)
#define NRF_VMC                         ((NRF_VMC_Type            *) NRF_VMC_BASE)
#define NRF_GPIO                        ((NRF_GPIO_Type           *) NRF_GPIO_BASE)


/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group nrf9120_MLM1 */
/** @} */ /* End of group Nordic Semiconductor */

#ifdef __cplusplus
}
#endif


#endif  /* nrf9120_MLM1_H */

